[

{"details":"Transfer order  dated 26.06.2024  1. Shri Avinash P. Pathak (IAS:SCS:2013) Chief Executive Officer, Zilla Parishad, Beed has been posted as Collector, Beed.",
 "title":"IAS Transfer dated 26.06.2024",
"publishdatetime":"26.06.2024"}
,

{"details":"Transfer order  dated 25.06.2024  1. Shri. Dilip Gawade (IAS:SCS:2007) has been posted as Divisional Commissioner, Chhatrapati Sambhajinagar Division, Chhatrapati Sambhajinagar  2. Shri Ravindra Binwade (IAS:RR:2012) Additional Municipal Commissioner, Pune Municipal Corporation, Pune has been posted as Commissioner, Agriculture, Pune.",
 "title":"IAS Transfer dated 25.06.2024",
"publishdatetime":"25.06.2024"}
,

{"details":"Transfer order  dated 18.06.2024  1. Smt.V. Radha (IAS:RR:1994) has been posted as Principal Secretary (Agriculture), Agriculture and ADF Department, Mantralaya, Mumbai.  2. Shri.Tukaram Mundhe (IAS:RR:2005) Secretary (AD), Agriculture and ADF Department, Mantralaya, Mumbai has been posted as Development Commissioner (Un-organised Labour), Mumbai.  3. Shri Ranjit Kumar (IAS:RR:2008) has been posted as Additional Director General, YASHADA, Pune.  4. Shri Amgothu Sri Ranga Naik (IAS:RR:2009) Joint Commissioner, State Tax, Mumbai has been posted as Commissioner (Family Welfare) and Director, National Health Mission, Mumbai.  5. Smt.Nima Arora (IAS:RR:2014) Director, Information Technology, Mumbai has been posted as Joint Commissioner, State Tax, Mumbai.  6. Shri Aman Mittal (IAS:RR:2015) Deputy Secretary, Water Supply and Santation Department, Mantralaya, Mumbai has been posted as Joint Chief Executive Officer, Maharashtra Institution for Transformation (MITRA), Mumbai.  7. Shri.Rohan Ghuge (IAS:RR:2018) Chief Executive Officer, Zilla Parishad, Wardha has been posted as Chief Executive Officer, Zilla Parishad, Thane.",
 "title":"IAS Transfer dated 18.06.2024",
"publishdatetime":"18.06.2024"}
,

{"details":"Transfer order  dated 04.06.2024  1. Dr.H.P.Tummod (IAS:SCS:2008) Development Commissioner (Un-organised Labour), Mumbai has been posed as Commissioner, Labour, Mumbai.  2. Shri Kanhuraj H. Bagate (IAS:SCS:2011) has been posted as Managing Director, Mah. State Horticulture and Drug Plant Board, Pune.  3. Shri Richard Yanthan (IAS:RR:2020) Project Officer, ITDP, Dharni and Assistant Collector, Dharni sub Division, Amaravati has been posted as Joint Managing Director, MAHADISCOM, Kalyan  4. Shri Kuladeep Jangam (IAS:RR:2020) Assistant Collector, Deglur Sub Division, Nanded has been posted Chief Executive Officer, Zilla Parishad, Buldhana  5. Shri Jithin Rehman (IAS:RR:2020) Project Officer, ITDP and Assistant Collector, Nashik sub Division, Nashik has been posted as Chief Executive Officer, Zilla Parishad, Wardha  6. Shri Dileep Sardesai (Appointment by Selection to IAS vide DOPT Notification dated 24.05.2024) Deputy Commissioner, State Tax, Mumbai has been posted as Commissioner, State Common Entrance Exam Cell, Mumbai.  7. Shri Anand Bhandari (Appointment by Selection to IAS vide DOPT Notification dated 24.05.2024) Director, Panchayat Raj, Maharashtra State, Pune has been posted as Additional Settlement Commissioner and Additional Director, Land Records, Pune  8. Shri Aziz Shaikh (Appointment by Selection to IAS vide DOPT Notification dated 24.05.2024) Municipal Commissioner, Ulhasnagar Municipal Corporation, Ulhasnagar has been posted as Municipal Commissioner, Ulhasnagar Municipal Corporation, Ulhasnagar  9. Shri Bhalchandra Chavan (Appointment by Selection to IAS vide DOPT Notification dated 24.05.2024) Chief Account and Finance Officer, Zilla Parishad, Nashik has been posted as Secretary, Maharashtra State Child Rights Commission, Mumbai. ",
 "title":"IAS Transfer dated 04.06.2024",
"publishdatetime":"04.06.2024"}
,

{"details":"Transfer order  dated 27.05.2024  1. Shri Deepak Taware (IAS:MH:2013) has been posted as Commissioner, Co-operation and Registrar, Co-Operative Societies, Pune  ",
 "title":"IAS Transfer dated 27.05.2024",
"publishdatetime":"27.05.2024"}
,

{"details":"Transfer order  dated 21.05.2024  1. Shri Ashish Yerekar (IAS:MH:2018) Chief Executive Officer, Zilla Parishad, Ahmednagar has been posted as Chief Executive Officer, Zilla Parishad, Thane.  2. Smt.Neha Bhosale (IAS:MH:2020) has been posted as Chief Executive Officer, Zilla Parishad, Hingoli.",
 "title":"IAS Transfer dated 24.05.2024",
"publishdatetime":"24.05.2024"}
,

{"details":"Transfer order  dated 29.04.2024  1. Shri P.Velrasu (IAS:MH:2002) has been posted as Divisional Commissioner, Konkan Division, Mumbai.  2. Dr.M.P.Kalyankar, (IAS:MH:2007) Divisional Commissioner, Konkan Division, Mumbai has been posted as Chief Executive Officer, Slum Rehabilition Authority, Mumbai.",
 "title":"IAS Transfer dated 29.04.2024",
"publishdatetime":"29.04.2024"}
,

{"details":"Transfer order  dated 26.04.2024  1. Smt.Idzes Angmo Kundan, (IAS:MH:1996) Principal Secretary, Minority Development Department, Mantralaya, Mumbai has been posted as Principal Secretary, School Education and Sports Department, Mantralaya, Mumbai.  2. Shri Ranjit Singh Deol (IAS:MH:1998) Principal Secretary, School Education and Sports Department, Mantralaya, Mumbai has been posted as Principal Secretary, Food, Civil Supplies and Consumer Protection Department, Mantralaya, Mumbai.  3. Smt.Anshu Sinha, (IAS:MH:1999) has been posted as Principal Secretary and Special Enquiry Officer (2), General Administration Department, Mantralaya, Mumbai  ",
 "title":"IAS Transfer dated 26.04.2024",
"publishdatetime":"26.04.2024"}
,

{"details":"Transfer order  dated 16.04.2024  1. Shri Ganesh Patil (IAS:MH:2008) Joint Secretary, Agriculture and ADF Department, Mantralaya, Mumbai has been posted as Secretary, Skill Development, Entrepreneurnship and Innovation Department, Mantralaya, Mumbai.",
 "title":"IAS Transfer dated 16.04.2024",
"publishdatetime":"16.04.2024"}
,

{"details":"Transfer order  dated 10.04.2024  1. Dr.Rajagopal Devara (IAS:MH:1992) has been posted as  Additional Chief Secretary and Development Commissioner, Planning Department, Mantralaya, Mumbai  2. Shri Saurabh Vijay, (IAS:MH:1998) Principal Secretary and Development Commissioner, Planning Department, Mantralaya, Mumbai has been posted as Principal Secretary (Expenditure), Finance Department, Mantralaya, Mumbai  ",
 "title":"IAS Transfer dated 10.04.2024",
"publishdatetime":"10.04.2024"}
,

{"details":"Transfer order  dated 08.04.2024  1. Smt.Anshu Sinha, (IAS:MH:1999) has been posted as Secretary, Maharashtra State Child Rights Commission, Mumbai.  2. Shri Dilip Gawade, (IAS:MH:2007) has been posted as Dairy Development Commissioner, Mumbai.  3. Smt.Rubal Prakher Agarwal, IAS (2008) has been posted as Managing Director, Maha-Mumbai Metro Operation Corporation Ltd., Mumbai.   4. Smt.Swati Mhase-Patil, (IAS:MH:2008) has been posted as Managing Director, FILMCITY, Mumbai.  5. Shri Ramesh Chavan (IAS:MH:2013) has been posted as CEO, Mahtma Phule Jivandai Arogya Yojna Society, State Assurance Society, Mumbai.  6. Shri Shubham Gupta (IAS:MH:2019) CEO, ZP, Dhule has been posted as MC, Sangli-Miraj-Kupwad City Municipal Corporation, Sangli.",
 "title":"IAS Transfer dated 08.04.2024",
"publishdatetime":"08.04.2024"}
,

{"details":"Transfer order  dated 03.04.2024  1. Smt.Anshu Sinha, (IAS:MH:1999) has been posted as Managing Director, Mahtma Phule Backward Class Development Corporation, Mumbai.  2. Shri E. Ravendiran (IAS:MH:2008) has been posted as Mission Director, Jal Jeevan Mission, Navi Mumbai.  3. Shri A.B.Dhulaj (IAS:MH:2009) has been posted as Managing Director, Maharashtra state Cotton Growers Marketing Federation, Mumbai.  4. Shri Deepak Taware (IAS:MH:2013) has been posted as Deputy Director General, YASHADA, Pune  ",
 "title":"IAS Transfer dated 03.04.2024",
"publishdatetime":"03.04.2024"}
,

{"details":"Transfer order  dated 22.03.2024  1. Dr.I.S.Chahal (IAS:MH:1989) has been posted as Additional Chief Secretary to Chief Minister, Mantralaya, Mumbai.  2. Shri P.Velrasu (IAS:MH:2002) has been posted as Secretary, Social Justice and Special Assistance Department, Mantralaya, Mumbai.",
 "title":"IAS Transfer order 22.03.2024",
"publishdatetime":"22.03.2024"}
,

{"details":"Transfer order  dated 20.03.2024  1. Dr.B.A.Gagarni (IAS:MH:1990) Additional Chief Secretary to Chief Minister, Mantralaya, Mumbai has been posted as Municipal Commissioner, Greater Mumbai Municipal Corporation, Mumbai.  2. Shri Saurabh Rao,(IAS:MH:2003) Commissioner, Co-Operation and Registrar, Co-operative Societies, Pune has been posted as Municipal Commissioner, Thane Municipal Corporation, Thane.  3. Shri Kailash Shinde (IAS:MH:2013) Joint Managing Director, CIDCO, Navi Mumbai has been posted as Municipal Commissioner, Navi Mumbai Municipal Corporation, Navi Mumbai.  4. Shri. Shubham Gupta, (IAS:MH:2019) Change the order dated 19.03.2024 and he has been posted as Chief Executive Officer, Zilla Parishad, Buldhana.",
 "title":"IAS Transfer dated 20.03.2024",
"publishdatetime":"20.03.2024"}
,

{"details":"Transfer order dated 19.03.2024  1.  Smt.Ashwini Bhide (IAS:MH:1995) Additional Municipal Commissioner, BMC, Mumbai has been posted as MD, Mumbai Metro Rail Corpotation, Mumbai.  2.  Dr.Amit Saini (IAS:MH:2007) Mission Director, Jal jeevan Mission, Navi Mumbai has been posted as Additional Municipal Commissioner, Greater Mumbai Municipal Corporation, Mumbai  3.  Shri Abhijit Bangar (IAS:MH:2008) Municipal Corporation, Thane Municipal Corporation, Thane has been posted as Additional Municipal Commissioner, Greater Mumbai Municipal Corporation, Mumbai  4.  Shri Rajesh Narvekar (IAS:MH:2009) Municipal Corporation, Navi Mumbai Municipal Corporation, Navi Mumbai has been posted as Commissioner, Co-Operation and Registrar, Co-operative Socities, Pune.  5.  Shri Sanjay Meena (IAS:MH:2011) has been posted as Metropolitan Commissioner, Nagpur Metropolitan Region Development Authority, Nagpur  6.  Shri Kunal Khemnar (IAS:MH:2012) Additional Municipal Commissioner, Pune Municipal Corporation, Pune has been posted as Commissioner, Sugar, Pune.  7.  Shri Santosh C. Patil (IAS:MH:2013) Chief Executive Officer, Zilla Parishad, Kolhapur has been posted as Chief Executive Officer, Zilla Parishad, Pune.  8.  Shri.Prithviraj B.P. (IAS:MH:2014) CEO, Smart City, Nagpur has been posted as Additional Municipal Commissioner, Pune Municipal Corporation, Pune  9.  Shri. Shubham Gupta, (IAS:MH:2019) Chief Executive Officer, Zilla Parishad, Dhule has been posted as Chief Executive Officer, Zilla Parishad, Jalgaon  10.  Shri Ankit (IAS:MH:2019) Chief Executive Officer, Zilla Parishad, Jalgaon has been posted   Chief Executive Officer, Zilla Parishad, Buldhana.   11.  Shri Karthikeyan S. (IAS:MH:2020) Chief Executive Officer, Smart City, Pune has been posted as Chief Executive Officer, Zilla Parishad, Kolhapur  12.  Shri Vishal Narwade (IAS:MH:2020) Chief Executive Officer, Zilla Parishad, Buldhana has been posted as Chief Executive Officer, Zilla Parishad, Dhule.  ",
 "title":"IAS Transfer dated 19.03.2024.",
"publishdatetime":"19.03.2024"}
,

{"details":"Transfer order dated 16.03.2024  1. Shri Anoop Kumar (IAS:MH:1990) Additional Chief Secretary (Agri.), Agri and ADF Department, Mantralaya, Mumbai has been posted as Additional Chief Secretary (Co-Operation and Marketing), Co-Operation, Marketing and Textile Department, Mantralaya, Mumbai.   2. Shri Astik Kumar Pandey (IAS:MH:2011) has been posted as Commissioner, Employment State Insurance Scheme, Mumbai.  3. Smt.Vasumana Pant (IAS:MH:2017) Managing Director, Maharashtra State Mining Corporation, Nagpur has been posted as Director, Sericulture, Nagpur.",
 "title":"IAS Transfer dated 16.03.2024.",
"publishdatetime":"16.03.2024"}
,

{"details":"Transfer order dated 15.03.2024  1. Shri Vikram Kumar (IAS:MH:2004) Municipal Commissioner, Pune Municipal Corporation, Pune has been posted as Additional Metropolitan Commissioner, MMRDA, Mumbai.  2. Dr.Rajendra Bhosale (IAS:MH:2008) has been posted as Municipal Commissioner, Pune Municipal Corporation, Pune  3. Shri Lahu Mali (IAS:MH:2009) has been posted as Director, Disaster Management, R&FD, Mantralaya, Mumbai.  4. Shri Kailash Pagare (IAS:MH:2010) Managing Director, M.S.Cotton Growers Marketing Federation, Mumbai has been posted as Commissioner, Integrated Child Development Scheme, Navi Mumbai.",
 "title":"IAS trasnfer dated 15.03.2024",
"publishdatetime":"15.03.2024"}
,

{"details":"Transfer order dated 13.03.2024    1.            Shri Anil Diggikar (IAS:MH:1990) has been posted as General Manager, BEST, Mumbai.    2.            Shri Sachindra Pratap Singh (IAS:MH:2007) Additional Director General, YASHADA, Pune has been posted as Settlement Commissioner and Director, Land Records, Pune.    3.            Shri P. Siva Sankar (IAS:MH:2011) has been posted as Deputy Director General, YASHADA, Pune    4.            Shri Satyam Gandhi (IAS:MH:2021) Assistant Collector, Deori Sub Division, GONDIA has been posted as Project Officer, ITDP, Dahanu and Assistant Collector, Dahanu Sub Division, PALGHAR.      ",
 "title":"IAS Transfer dated  13.03.2024",
"publishdatetime":"13.03.2024"}
,

{"details":"Transfer order dated 11.03.2024  1. Shri Sanjay Daine (IAS:MH:2012) Chief Executive Officer, Zilla Parishad, Hingoli has been posted as Collector, Gadchiroli.  ",
 "title":"IAS Transfer dated 11.03.2024",
"publishdatetime":"11.03.2024"}
,

{"details":"Transfer order dated 06.03.2024  1. Shri Niranjan Kumar Sudhansu (IAS:MH:2000) Settlement Commissioner and Director, Land Records, Pune  has been posted as Director General, YASHADA, Pune.",
 "title":"IAS Transfer dated 06.03.2024",
"publishdatetime":"06.03.2024"}
,

{"details":"Transfer order dated 05.03.2024  1. Shri Shrikant Deshpande (IAS:MH:1991) Additional Chief Secretary and Chief Electoral Officer, Maharashtra, Mantralaya, Mumbai has been posted as Additional Chief Secretary and Special Enqiury Officer (2), General Administration Department, Mantralaya, Mumbai.  2. Shri Aditya Jiwane (IAS:MH:2021) Project Director, ITDP, Bhamragad and Assistant Collector, Attapali Sub Division, Gadchiroli has been posted as Project Director, ITDP, Aheri and Assistant Collector, Aheri Sub Division, Gadchiroli.  ",
 "title":"IAS Transfer dated 05.03.2024",
"publishdatetime":"06.03.2024"}
,

{"details":"Transfer order dated 04.03.2024  1. Shri S.Chocklingam (IAS:MH:1996) Director General, YASHADA, Pune has been posted as Principal Secretary and Chief Electoral Officer, Maharashtra, Mantralaya, Mumbai.",
 "title":"IAS Transfer dated 04.03.2024",
"publishdatetime":"04.03.2024"}
,

{"details":"Transfer order dated 29.02.2024  1. Dr.Kiran H.Kulkarni (IAS:MH:2009) has been posted as Additional Chief Electoral Officer, Maharashtra, Mantralaya, Mumbai.",
 "title":"IAS Transfer dated 29.02.2024",
"publishdatetime":"29.02.2024"}
,

{"details":"Transfer order dated 23.02.2024  1. Shri Rajesh Kumar (IAS:MH:1988) Additional Chief Secretary (Co-Operation and Marketing), Co-Operation, Marketing and Textile Department, Mantralaya, Mumbai has been posted as Additional Chief Secretary (Revenue, Registration and Stamp), Revenue and Forest Department, Mantralaya, Mumbai.  2. Shri O.P.Gupta (IAS:MH:1992) Additional Chief Secretary (Expenditure), Finance Department, Mantralaya, Mumbai has been posted as Additional Chief Secretary (Finance), Finance Department, Mantralaya, Mumbai  3. Shri Sanjay Sethi (IAS:MH:1992) has been posted as Additional Chief Secretary (Transport & Ports), Home Department, Mantralaya, Mumbai  4. Shri Parrag Jaiin Nainutia (IAS:MH:1996) Principal Secretary (Transport & Ports), Home Department, Mantralaya, Mumbai has been posted as Principal Secretary (Information Technology), General Administration Department, Mantralaya, Mumbai  5. Shri Vijay Singhal (IAS:MH:1997) General Manager, BEST, Mumbai has been posted as Vice Chairman and Managing Director, CIDCO, Mumbai.  6. Shri.Milind Shambharkar, (IAS:MH:2008) has been posted as Chief Officer, Mumbai Repairs and Reconstruction Board, Mumbai.  7. Shri Lahu Mali (IAS:MH:2009) has been posted as Managing Director, Mah. State Horticulture and Drug Plant Corporation, Pune.  8. Smt.Kavita Dwivedi (IAS:MH:2011) Municipal Commissioner, Akola Municipal Corporation, Akola has been posted as Additional Divisional Commissioner, Pune Division, Pune  9. Shri M.J.Pradip Chandren (IAS:MH:2012) has been posted as Additional Development Commissioner (Industries), Mumbai.  10. Shri Kaustubh Diwegaonkar, (IAS:MH:2013) Project Director, Balasaheb Thakre Agri Business and Rural Transformation Project, Pune has been posted as Commissioner, Animal Husbandary, Pune.  11. Dr.Hemant Vasekar  (IAS:MH:2015) Commissioner, Animal Husbandary, Pune has been posted as Project Director, Balasaheb Thakre Agri Business and Rural Transformation Project, Pune   12. Shri. Karthikeyan S.  (IAS:MH:2020) Project Officer, ITDP, Kinwat and Assistant Collector, Kinwat, Nanded has been posted as Chief Executive Officer, Smart City, Pune.  13. Smt.Kavali Meghana (IAS:MH:2021) Assistant Collector, Selu Sub Disivion, PARBHANI has been posted as Project Officer, ITDP, Kinwat and Assistant Collector, Kinwat, Nanded.",
 "title":"IAS Transfer dated 23.02.2024",
"publishdatetime":"23.02.2024"}
,

{"details":"Transfer order dated 21.02.2024  1. Shri Kishan Jawale, IAS (2011) has been posted as Collector, Raigad. ",
 "title":"IAS Transfer dated 21.02.2024",
"publishdatetime":"21.02.2024"}
,

{"details":"Transfer order dated 14.02.2024  1. Smt.Rubal Prakher-Agarwal, IAS (2008) Commissioner, Integrated Child Development Scheme, Navi Mumbai has been posted as MD, MAVIM, Mumbai.  2. Shri Astik Kumar Pandey (IAS:MH:2011) Collector, Chatrapatti Sambhaji Nagar has been posted as Additional Settlement Commissioner and Additional Director, Land Records, Pune.  3. Shri Dilip Swami (IAS:MH:2011) has been posted as Collector, Chatrapatti Sambhaji Nagar.   4. Smt.Vasumana Pant (IAS:MH:2017) has been posted as Managing Director, Mah.State Mining Corporation, Nagpur.  5. Shri Suhas Gade, IAS (2021) Assistant Collector, Pusad Sub Disivion, Yavatmal has been posted Project Officer, ITDP, Pandharkawda and Assistant Collector, Kelapur Sub Disivion, Yavatmal.",
 "title":"IAS Transfer order 14.02.2024",
"publishdatetime":"14.02.2024"}
,

{"details":"Transfer order dated 12.02.2024  1. Shri Goraksha Gadilkar (IAS:MH:2013) Director, Sericulture, Nagpur has been posted Chief Executive Officer, Saibaba Sansthan Trust, Shridi.  ",
 "title":"IAS Transfer order 12.02.2024",
"publishdatetime":"12.02.2024"}
,

{"details":"Transfer order dated 07.02.2024  1. Dr.Rajesh Deshmukh (IAS:MH:2008) Collector, Pune has been posted as Commissioner, Sports and Youth, Pune.  2. Shri Suhas K. Diwase (IAS:MH:2009) Commissioner, Sports and Youth, Pune has been posted as Collector, Pune. ",
 "title":"Transfer order 07.02.2024",
"publishdatetime":"07.02.2024"}
,

{"details":"Transfer order dated 06.02.2024  1. Dr.C.L.Pulkundwar (IAS:MH:2008) Commissioner, Sugar, Pune has been posted as Divisional Commissioner, Pune Division, Pune.  ",
 "title":"Transfer order 06.02.2024",
"publishdatetime":"06.02.2024"}
,

{"details":"Transfer order dated 05.02.2024  1. Shri Saurabh Rao (IAS:MH:2003) Divisional Commissioner, Pune Division, Pune has been posted as Commissioner, Co-Operation and Registrar, Co-Operative Societies, Pune.  2. Shri Anil M. Kawade (IAS:MH:2003) Commissioner, Co-Operation and Registrar, Co-Operative Societies, Pune has been posted as Commissioner, Sugar, Pune.  3. Shri Anil Patil (IAS:MH:2012) Chief Executive Officer, Zilla Parishad, Gondia has been posted as Managing Director, Haffkine Bio-Pharma Corporation, Mumbai.  4. Shri D.K.Khillari  (IAS:MH:2013) Chief Executive Officer, Zilla Parishad, Satara has been posted as Director, Other Backward Bahujan Kalyan, Pune  5. Shri Rahul Gupta (IAS:MH:2017) Chief Executive Officer, Zilla Parishad, Dharashiv Joint Managing Director, MAHADISCOM, Chatrapatti Sambhaji Nagar.  6. Shri Muruganantham M (IAS:MH:2020)Project Officer, ITDP, Chandrapur and Assistant Collector, Chandrapur Sub Division, Chandrapur has been posted as Chief Executive Officer, Zilla Parishad, Gondia.  7. Smt. Yashni Nagarajan (IAS:MH:2020) Project Officer, ITDP, Pandharkawada and Assistant Collector, Kelapur Sub Division, YAVATMAL has been posted as Chief Executive Officer, Zilla Parishad, Satara.",
 "title":"Transfer order 05.02.2024",
"publishdatetime":"05.02.2024"}
,

{"details":"Transfer order dated 01.02.2024  1. Shri Prajit Nair (IAS:MH:2017) Chief Executive Officer, Zilla Parishad, Sindhudurg has been posted as Collector, Gondia.  2. Shri Mainak Ghosh (IAS:MH:2019) Chief Executive Officer, Zilla Parishad, Yavatmal has been posted as Chief Executive Officer, Zilla Parishad, Dharashiv.  3. Shri Vishal Narwade (IAS:MH:2020) Project Officer, ITDP, Kalwan and Assistant Collector, Kalwan Sub Division, NASHIK has been posted as Chief Executive Officer, Zilla Parishad, Buldhana.  4. Shri Chinmay Gotmare (IAS:2009:Assam Meghalya) Collector, Gondia has been posted as Member Secretary, Vidharbha Statutory Development Board, Nagpur.  ",
 "title":"Transfer order 01.02.2024",
"publishdatetime":"01.02.2024"}
,

{"details":"Transfer order dated 31.01.2024  1. Shri Nitin Patil (IAS:MH:2007) Special Commissioner, Goods and Service Tax, Maharashtra, Mumbai has been posted as Secretary, State Human Rights Commission, Mumbai.  2. Shri Abhay Mahajan (IAS:MH:2007) Secretary, Divyang Kalyan Vibhag has been posted as Special Commissioner, Goods and Service Tax, Maharashtra, Mumbai  3. Shri Sanjay L. Yadav (IAS:MH:2009) Joint Managing Director, MSRDC, Mumbai has been posted as   Collector, Mumbai City, Mumbai.  4. Shri Rahul Rekhawar, (IAS:MH:2011) Collector, Kolhapur has been posted as Director, Mah State Council of Education, Research and Training (MSCERT), Pune.  5. Shri Rajendra Kshirsagar (IAS:MH:2011) Collector, Mumbai City, Mumbai has been posted as   Collector, Mumbai Sub-urban District, Mumbai  6. Shri Amol Yedge, (IAS:MH:2014) Director, Mah State Council of Education, Research and Training (MSCERT), Pune has been posted as Collector, Kolhapur.  7. Shri Manuj Jindal (IAS:MH:2017) Chief Executive Officer, Zilla Parishad, Thane has been posted as Joint Managing Director, MSRDC, Mumbai.  8. Smt.Bhagyashree Vispute (IAS:MH:2017) Chief Executive Officer, Zilla Parishad, Buldhana has been posted as   Chief Administrator (New Township), CIDCO, Chatrapatti Sambhaji Nagar  9. Shri Avishyant Panda (IAS:MH:2017) Chief Executive Officer, Zilla Parishad, Amravati has been posted as Commissioner, Textile, Nagpur  10. Shri Vaibhav Waghmare (IAS:MH:2019) Project Officer, ITDP, Aheri and Assistant Collector, Aheri Sub Division, GADCHIROLI has been posted Chief Executive Officer, Zilla Parishad, Washim  11. Smt.Sanjita Mohapatra (IAS:MH:2020) Project Officer, ITDP, Dahanu and Assistant Collector, Dahanu Sub Division, PALGHAR has been posted as Chief Executive Officer, Zilla Parishad, Amravati  12. Shri Mandar Patki (IAS:MH:2020) Project Officer, ITDP, Taloda and Assistant Collector, Taloda Sub Division, NANDURBAR has been posted as Chief Executive Officer, Zilla Parishad, Yavatmal.  13. Shri Makrand Deshmukh (IAS:MH:2020) Joint Secretary, Chief Secretary Office, Mantralaya, Mumbai has been posted as Chief Executive Officer, Zilla Parishad, Sindhudurg  14. Smt.Natisha Mathur (IAS:MH:2020) Cadre transfer Gujarat to Maharashtra has been posted as Project Officer, ITDP, Taloda and Assistant Collector, Taloda Sub Division, Nandurbar  15. Smt.Mansi (IAS:MH:2021) Assistant Collector, Ballarpur Sub Division, CHANDRAPUR has been posted as   Assistant Collector, Desaigunj Sub Division, GADCHIROLI.  16. Shri Pulkit Singh (IAS:MH:2021) Assistant Collector, Chandwad Sub Division, Nashik has been posted as   Project Officer, ITDP, Kalwan and Assistant Collector, Kalwan Sub Division, NASHIK  17. Smt. Karishma Nair (IAS:MH:2021) Assistant Collector, Beed Sub Disivion, BEED has been posted as Project Officer, ITDP, Jawhar and Assistant Collector, Jawhar Sub Division, PALGHAR.",
 "title":"Transfer order 31.01.2024",
"publishdatetime":"31.01.2024"}
,

{"details":"Transfer order dated 24.01.2024  1. Smt.Kavali Meghana, IAS (2021) Assistant Collector, Selu Sub Disivion, PARBHANI has been posted as Assistant Collector, Parturr Sub Disivion, JALANA.  ",
 "title":"Transfer order 24.01.2024",
"publishdatetime":"24.01.2024"}
,

{"details":"Transfer order dated 23.01.2024  1. Smt.Karishma Nair, IAS (2021) Assistant Collector, Beed Sub Disivion, Beed has been posted Assistant Collector, Kandhar Sub Disivion, Nanded.  2. Shri Pulkit Singh, IAS (2021) Assistant Collector, Chandwad Sub Disivion, Nashik has been posted Assistant Collector, Buldhana Sub Disivion, Buldhana.  3. Shri Suhas Gade, IAS (2021) Assistant Collector, Pusad Sub Disivion, Yavatmal has been posted Assistant Collector, Drayapur Sub Disivion, Amravati.  4. Smt.Mansi, IAS (2021) Assistant Collector, Ballarpur Sub Disivion, Chandrapur has been posted Assistant Collector, Malkapur Sub Disivion, Buldhana.",
 "title":"Transfer order 23.01.2024.",
"publishdatetime":"23.01.2024"}
,

{"details":"Transfer order dated 10.01.2024  1. Smt.Kavali Meghana, IAS (2021) Assistant Collector, Selu Sub Disivion, PARBHANI has been posted as Assistant Collector, Mehkar Sub Disivion, BULDHANA.",
 "title":"Transfer order 10.01.2024.",
"publishdatetime":"10.01.2024"}
,

{"details":"Transfer order dated 05.01.2024  1. Smt.Nidhi Choudhari, IAS (2012) Joint Commissioner, State Tax, Mumbai has been posted as Commissioner, Skill Development, Employment and Enterpurnership, Navi Mumbai.  2. Shri Shanmugarajan S. IAS (2013) has been posted as Joint Commissioner, State Tax, Mumbai.  ",
 "title":"Transfer order 05.01.2024.",
"publishdatetime":"05.01.2024"}
,

{"details":"Transfer order dated 04.01.2024  1. Dr.Ramaswami N., IAS (2004) Commissioner, Skill Development, Employment and Enterpurnership,  Navi Mumbai has been posted as Secretary (Accounts and Treasury), Finance Department, Mantralaya, Mumbai.  2. Dr. Madhav Kusekar, IAS (2014) Chairman, District Caste Scrutiny Committee, Yavatmal has been posted as Vice Chairman and Managing Director, Maharashtra State Transport Corporation, Mumbai.  ",
 "title":"Transfer order 04.01.2024.",
"publishdatetime":"04.01.2024"}
,

{"details":"      Dr.Nitin Kareer, IAS (1988) Additional Chief Secretary (Finance), Finance Department, Mantralaya, Mumbai has been posted as Chief Secretary, Government of Maharashtra, Mantralaya, Mumbai.",
 "title":"Chief Secretary appointment 31.12.2023",
"publishdatetime":"31.12.2023"}
,

{"details":"Transfer order dated 20.12.2023  1. Shri Santosh Kumar, IAS (1994) has been posted as Principal Secretary and OSD (Appeals), Revenue & Forest Department, Mantralaya, Mumbai.  2. Dr.Pravinkumar Deore, IAS (2013), Director, OBC Bahujan Welfare, Pune has been posted as Chairman and Managing Director, Mah.State Warehousing Corporation, Pune.",
 "title":"Transfer order 20.12.2023.",
"publishdatetime":"20.12.2023"}
,

{"details":"Transfer order dated 05.12.2023  1. Shri C.K.Dange, IAS (2010) Jt.MD, MAHADISCOM, Kalyan has been posted as Chief Executive Officer, Mah.Medical Goods Procurement Authority, Mumbai.  2. Smt. Devayani, IAS (2021) After completion of Phase-II training he has been posted as Assistant Collector, Phaijpur Sub Division, JALGAON.  3. Shri Pulkit Singh, IAS (2021) After completion of Phase-II training he has been posted as Assistant Collector, Chandwad Sub Division, NASHIK.",
 "title":"Transfer order 05.12.2023.",
"publishdatetime":"05.12.2023"}
,

{"details":"Transfer order dated 04.12.2023  1. Shri Prakash Khaple, IAS (2013) Jt.MD, MAHADISCOM, Chhatrapati Sambhaji Nagar has been posted as Commissioner, Soil and Water Conservartion, Chhatrapati Sambhaji Nagar.",
 "title":"Transfer order 04.12.2023.",
"publishdatetime":"04.12.2023"}
,

{"details":"Transfer order dated 01.12.2023  1. Shri Aditya Jiwane, IAS (2021) After completion of Phase-II training he has been posted as Project Officer, ITDP, Bhamragad-cum-Assistant Collector, Atapalli Sub Division, GADCHIROLI  2. Smt.Karishma Nair, IAS (2021) After completion of Phase-II training he has been posted as Assistant Collector, Beed Sub Disivion, BEED.  3. Smt.Kavali Meghana, IAS (2021) After completion of Phase-II training he has been posted as Assistant Collector, Selu Sub Disivion, PARBHANI  4. Shri Vinayak Mahamuni, IAS (2021) After completion of Phase-II training he has been posted as Assistant Collector, Nandurbar Sub Disivion, NANDURBAR.  5. Smt.Minnu P M, IAS (2021) After completion of Phase-II training he has been posted as Assistant Collector, Bhatukali-Tiwasa Sub Division, AMARAVATI.  6. Shri Rahul Kumar Meena, IAS (2021) After completion of Phase-II training he has been posted as Project Officer, ITDP, Gadchiroli-cum-Assistant Collector, Gadchiroli Sub Division, GADCHIROLI  7. Shri Satyam Gandhi, IAS (2021) After completion of Phase-II training he has been posted as Assistant Collector, Deori Sub Division, GONDIA.  8. Shri Suhas Gade, IAS (2021) After completion of Phase-II training he has been posted as Assistant Collector, Pusad Sub Disivion, YAVATMAL.  9. Smt.Mansi, IAS (2021) After completion of Phase-II training he has been posted as Assistant Collector, Ballarpur Sub Division, CHANDRAPUR.",
 "title":"Transfer order 01.12.2023.",
"publishdatetime":"01.12.2023"}
,

{"details":"Transfer order dated 17.11.2023  1. Dr.Bhausaheb Dangade, IAS (2011) Municipal Commissioner, Kalyan-Dombivali Municipal Corporation, Kalyan has been posted as Managing Director, Maharashtra Petrochemicals Corporation Limited, Mumbai.  2. Shri Shridhar Dube, IAS (2014) Chairman, District Caste Verification Committee, Raigad has been posted as Managing Director, Mah.State Co-operative Marketing Federation, Mumbai.  3. Dr.Indurani Jakhar, IAS (2016) Managing Director, MAVIM, Mumbai has been posted as Municipal Commissioner, Kalyan-Dombivali Municipal Corporation, Kalyan.",
 "title":"Transfer order 17.11.2023.",
"publishdatetime":"17.11.2023"}
,

{"details":"Transfer order dated 13.11.2023  1. Shri Asheesh Sharma, IAS (1997) Principal Secretary to Deputy Chief Minister has been posted as Commissioner, State Tax (GST), Mumbai.  2. Shri Pravin Puri, IAS (2011) Joint Secretary, Water Supply and Sanitation Department, Mantralaya, Mumbai has been posted as Commissioner for Persons with Disabilities, Pune.  3. Shri Deepak Taware, IAS (2013) Chairman and Managing Director, Maharashtra State Warehouising Corporation, Pune has been posted as Commissioner, Employees State Insurance Scheme, Mumbai.  4. Shri Vikas Pansare, IAS (2014) Chairman, District Caste Verification Committee, Ahmednagar has been posted as Additional Divisional Commissioner, Konkan Division, Mumbai.  5. Shri Aman Mittal, IAS (2015) Managing Director, Maharashtra Petrochemicals Corporation Limited, Mumbai has been posted as Deputy Secretary, Water Supply and Sanitation Department, Mantralaya, Mumbai.",
 "title":"Transfer order 13.11.2023.",
"publishdatetime":"13.11.2023"}
,

{"details":"Transfer order dated 27.10.2023  1. Shri Sachindra Pratap Singh, IAS (2007) has been posted as Additional Director General, YASHADA, Pune.  2. Shri Radhabinod Aribam Sharma, IAS (2012) Chief Administrator (New Township), CIDCO, Chattrapati Sambhaji Nagar has been posted as Jt.MC, MMRDA, Mumbai.  3. Shri S.Ramamoorthy, IAS (2013) Jt.MC, MMRDA, Mumbai has been posted as Secretary, Fee Regulatory Authority, Mumbai.  4. Shri Aman Mittal, IAS (2015) has been posted as Managing Director, MPCL, Mumbai.  ",
 "title":"Transfer order 27.10.2023.",
"publishdatetime":"27.10.2023"}
,

{"details":"Transfer order dated 23.10.2023  1. Shri Sachindra Pratap Singh, IAS (2007) Chairman and MD, Pune Mahanagar Parivahan Mahamandal Limited, Mumbai has been posted as Commissioner for Persons with Disabilities, Pune.  2. Shri S.G.Kolte, IAS (2010) Chief Executive Officer, Smart City, Pune has been posted as Chairman and MD, Pune Mahanagar Parivahan Mahamandal Limited, Mumbai.  3. Shri Kailash Pagare, IAS (2010) has been posted as MD, M.S.Cotton Growers Marketing Federation, Mumbai.  4. Shri Sudhakar Telang, IAS (2011) MD, M.S.Co-op. Marketing Federation, Mumbai has been posted as Controller of Rationing and Director, Civil Supplies, Mumbai  5. Shri Ajit Pawar, IAS (2012) has been posted as Commissioner, Dairy Development, Mumbai.",
 "title":"Transfer order 23.10.2023.",
"publishdatetime":"23.10.2023"}
,

{"details":"Transfer order dated 19.10.2023  1. Dr.Praveen Gedam, IAS (2002) has been posted as Commissioner, Agriculture, Pune.  2. Shri Sunil S. Chavan, IAS (2007) Commissioner, Agriculture, Pune has been posted as Secretary, Soil and Water Conservation Department, Mantralaya, Mumbai  ",
 "title":"Transfer order 19.10.2023.",
"publishdatetime":"19.10.2023"}
,

{"details":"Transfer order dated 10.10.2023  1. Smt.Radhika Rastogi, IAS (1995) Principal Secretary (Torusim), Tourism and Cultural Affairs Department, Mantralaya, Mumbai has been posted as Principal Secretary (A&S), Home Department, Mantralaya, Mumbai.  2. Shri Lahu Mali, IAS (2009) Secretary, Fee Regulatory Authority, Mumbai has been posted as Chief Executive Officer, Mah.Medical Goods Procurement Authority, Mumbai.",
 "title":"Transfer order 10.10.2023",
"publishdatetime":"10.10.2023"}
,

{"details":"Transfer order dated 29.09.2023  1. Shri Vijay Waghmare, IAS (2004) has been posted as Secretary, Tribal Development Department, Mantralaya, Mumbai.",
 "title":"Transfer order 29.09.2023",
"publishdatetime":"29.09.2023"}
,

{"details":"Transfer order dated 14.09.2023  1. Shri D.T.Waghmare, IAS (1994) PS (A&S), Home Deppartment, Mantralaya, Mumbai has been posted as PS, Medical Education and Drug Department, Mantralaya, Mumbai.  2. Dr.Ashwini Joshi, IAS (2006), Secretary, Medical Education and Drug Department, Mantralaya, Mumbai has been posted as Additional Municipal Commissioner, Greater Mumbai Municipal Corporation, Mumbai.  ",
 "title":"Transfer order 14.09.2023.",
"publishdatetime":"14.09.2023"}
,

{"details":"Transfer order dated 31.08.2023  1. Smt.Manisha Verma, IAS (1993) has been posted as Managing Director, Maharashtra State Financial Corporation, Mumbai.  2. Dr.Mangesh Gondavale, IAS (2015) has been posted as Managing Director, Maharashtra Agro Industries Development Corporation, Mumbai.  ",
 "title":"Transfer order 31.08.2023.",
"publishdatetime":"31.08.2023"}
,

{"details":"Transfer order dated 23.08.2023  1. Shri H.P.Tummod, IAS (2008) Collector, Buldhana has been posted as Development Commissioner, Un-Organised Labour, Mumbai.  2. Shri Kanhuraj Bagate, IAS (2011) Controller of Rationing and Director, Civil Supplies, Mumbai has been posted as Managing Director, MAHANAND, Mumbai.  3. Dr.Kiran Patil, IAS (2015) has been posted as Collector, Buldhana.  ",
 "title":"Transfer order 23.08.2023.",
"publishdatetime":"23.08.2023"}
,

{"details":"Transfer order dated 22.08.2023  1. Shri Kishor Tawade, IAS (2011) Managing Director, Shivshahi Punarvasan Project, Mumbai has been posted as Collector, Sindhudurg.  2. Smt.K.Manjulakshmi, IAS (2013) Collector, Sindhudurg has been posted as Municipal Commissioner, Kolhapur Municipal Corporation, Kolhapur.  ",
 "title":"Transfer order 22.08.2023",
"publishdatetime":"22.08.2023"}
,

{"details":"Transfer order dated 14.08.2023  1. Shri Pradipkumar Dange, IAS (2011) Joint Secretary-cum-Director, SBM-Gramin, Water Supply and Sanitation Department, Mumbai has been posted as State Project Director, Samgra Siksha Abhiyan, Mumbai.",
 "title":"Transfer order 14.08.2023.",
"publishdatetime":"14.08.2023"}
,

{"details":"Transfer order dated 09.08.2023  1. Shri Kailash Shinde, IAS (2013) has been posted as Joint Managing Director, CIDCO, Navi Mumbai.  2. Shri Sanjay Katkar, IAS (2014) Joint Managing Director, CIDCO, Navi Mumbai has been posted as Municipal Commissioner, Meera-Bhayander Municipal Corporation, Bhayander.  ",
 "title":"Transfer order 09.08.2023",
"publishdatetime":"09.08.2023"}
,

{"details":"Transfer order dated 04.08.2023  1. Smt.Sonia Sethi, IAS (1994) has been posted as PS  (R&R), Revenue & Forest Department, Mantralaya, Mumbai.  2. Shri Rupinder Singh, IAS (1996) has been posted as Resident Commissioner and PS, Maharashtra Sadan, New Delhi.  3. Shri Gorksha Gadilkar, IAS (2013) Chairman, District Caste Verification Committee, Wardha has been posted as Director, Sericulture, Nagpur.  4. Shri Prakash B.Khaple, IAS (2013) Chairman, District Caste Verification Committee, Nanded has been posted as Joint Managing Director, MAHADISCOM, Aurangabad.  5. Shri Avinash Pathak, IAS (2013) Additional Divisional Commissioner, Aurangabad Division, Aurangabad has been posted as Chief Executive Officer, Zilla Parishad, Beed.  6. Shri Gulab R.Kharat, IAS (2013) Chairman, District Caste Verification Committee, Jalgaon has been posted as Managing Director, Shivshahi Punarvasan Project, Mumbai.  7. Dr.Pravinkumar Deore, IAS (2013) Chairman, District Caste Verification Committee, Pune has been posted as Director, OBC Bahujan Kalyan, Pune.  8. Shri Milindkumar W.Salwe, IAS (2013) Chairman, District Caste Verification Committee, Gadchiroli has been posted as Joint Commissioner, State Tax, Aurangabad.  9. Shri Satishkumar D. Khadke, IAS (2014) Chief Land Surevey Officer, CIDCO, Navi Mumbai has been posted as Metropolitan Commissioner, Nashik Metro Region Development Authority, Nashik.  10. Shri Sanjay S. Katkar, IAS (2014) Deputy Commissioner (Revenue), Nashik Division, Nashik has been posted as Joint Managing Director, CIDCO, Navi Mumbai  11. Shri Parag S. Soman, IAS (2014) Deputy Commissioner (Revenue), Aurangabad Division, Aurangabad has been posted as Chief Executive Officer, Mumbai Metropolitan Region Slum Rehabilation Authority, Mumbai.  12. Shri Anilkumar K. Pawar, IAS (2014) Municipal Commissioner, Vasai-Virar Municipal Corporation, Virar has been promoted in IAS and posted insitu as Municipal Commissioner, Vasai-Virar Municipal Corporation, Virar.  13. Shri Sachin B.Kalantre, IAS (2014) Managing Director, Maharashtra State Seeds Corporation, Akola has been promoted in IAS and posted insitu as Managing Director, Maharashtra State Seeds Corporation, Akola  14. Shri Manoj V. Ranade, IAS (2014) Deputy Commissioner (General Administration), Konkan Division, Mumbai has been posted as Director, Municipal Administration, Mumbai.  15. Smt.Neha Bhosale (2020) Project Officer-cum-Assistant Collector, ITDP, Kinwat, Nanded has been posted as Project Officer-cum-Assistant Collector, ITDP, Jawhar, Palghar.  16. Shri. Murugnantham M. (2020) Project Officer-cum-Assistant Collector, ITDP, Chandrapur has been posted as Project Officer-cum-Assistant Collector, ITDP, Gadchiroli.  17. Shri. Richard Yanthan (2020) Assistant Collector, Amravati Sub Division, Amaravati has been posted as Project Officer-cum-Assistant Collector, ITDP, Dharni, Amaravati.  18. Shri. Karthikeyan S. (2020) Assistant Collector, Pusad Sub Division, Yavatmal has been posted as Project Officer-cum-Assistant Collector, ITDP, Kinwat, Nanded.",
 "title":"Transfer order 04.08.2023.",
"publishdatetime":"04.08.2023"}
,

{"details":"Transfers Order dated 28.07.2023  1. Shri Shravan Hardikar (IAS:MH:2005) Additional Municipal Commissioner, BMC, Mumbai has been posted as Managing Director, Maharasthra Metro Rail Corporation, Nagpur.  ",
 "title":"Transfer order 28.07.2023.",
"publishdatetime":"28.07.2023"}
,

{"details":"Transfers Order dated 27.07.2023  1. Shri Asheesh Sharma (IAS:MH:1997) Additional Metropolitan Commissioner, MMRDA, Mumbai has been posted as Principal Secretary to Deputy Chief Minister,Mantralaya, Mumbai.  ",
 "title":"Transfer order 27.07.2023.",
"publishdatetime":"27.07.2023"}
,

{"details":"Sl. No. Transfers Order dated 21.07.2023  1. Shri.Rajendra Shankar Kshirsagar (IAS:MH:2011) Joint Secretary to Chief Secretary Office, Mantralaya, Mumbai has been posted as Collector, Mumbai City Mumbai.  2. Shri.Varsha Thakur-Ghuge (IAS:MH:2011) Chief Executive Officer, Zilla Parishad, Nanded has been posted as Collector Latur.  3. Shri Sanjay Chavan (IAS:MH:2011) Chief Executive Officer, Zilla Parishad, Kolhapur has been posted as Additional Controller of Stamp, Mumbai.  4. Shri Ayush Prasad (IAS:MH:2015) Chief Executive Officer, Zilla Parishad, Pune has been posted as Collector, Jalgaon.  5. Smt.Buveneswari S (IAS:MH:2015) Chief Executive Officer, Zilla Parishad, Dhule has been posted as Collector, Washim.  6. Shri. Ajit Kumbhar (IAS:MH:2015) Joint Commissioner, Municipal Corpn of Greater Mumbai has been posted as Collector, Akola.  7. Dr.Shrikrishnanath B. Panchal, (IAS:MH:2016) Chief Executive Officer, Zilla Parishad, Yavatmal has been posted as Collector, Jalna.  8. Dr.Pankaj Ashiya (IAS:MH:2016) Chief Executive Officer, Zilla Parishad, Jalgaon has been posted as Collector, Yavatmal.  9. Shri.Kumar Ashirwad (IAS:MH:2016) Chief Executive Officer, Z.P., Gadchiroli has been posted as Collector, Solapur.  10. Shri Abhinav Goel (IAS:MH:2016) Chief Executive Officer, Zilla Parishad, Latur has been posted as Collector, Dhule.  11. Shri. Saurabh Katiyar (IAS:MH:2016) Chief Executive Officer, Z.P., AKOLA has been posted as Collector, Amravati.  12. Smt.Trupti Dhodmise (IAS:MH:2019) Project Officer-cum-Assistant Collector DHULE has been posted as Chief Executive Officer, Z.P., Sangli.  13. Shri.Ankit,(IAS:MH:2019) Project Officer-cum-Assistant Collector Aheri, GADCHIROLI has been posted as Chief Executive Officer, Z.P., Jalgaon.  14. Shri. Shubham Gupta, (IAS:MH:2019) Project Officer-cum-Assistant Collector Attapali SDO, Po.Bharmragad, ITDP, GADCHIROLI has been posted as Chief Executive Officer, Z.P., Dhule.  15. Smt.Minal Karanwal,(IAS:MH:2019) Project Officer-cum-Assistant Collector, ITDP, Nandurbar NANDURBAR has been posted as Chief Executive Officer, Z.P., Nanded.  16. Dr.Mainak Ghosh (IAS:MH:2019) Project Officer, ITDP, Gadchiroli -cum-Assistant Collector,  Gadchiroli has been posted as Chief Executive Officer, Z.P., Yavatmal.  17. Smt. Manisha Manikrao Awhale, (IAS:MH:2019) Project Officer-cum-Assistant Collector, ITDP, SOLAPUR has been posted as Chief Executive Officer, Z.P., Solapur.  18. Shri. Sawan Kumar (IAS:MH:2019) Project Officer-cum-Assistant Collector, Dharni, ITDP, AMARAVATI has been posted as Chief Executive Officer, Z.P., Nandurbar.  19. Shri. Anmol Sagar (IAS:MH:2019), Assistant Collector, Deori Sub Division, GONDIA has been posted as Chief Executive Officer, Z.P., Latur.  20. Smt. Ayushi Singh (IAS:MH:2019), Project Officer-cum-Assistant Collector, Jawhar, ITDP, PALGHAR has been posted as Chief Executive Officer, Z.P., Gadchiroli.  21. Smt. Vaishnavi B.,(IAS:MH:2019), Assistant Collector, Tumsar Sub Division, BHANDARA has been posted as   Chief Executive Officer, Z.P., Akola.  22. Smt.Pavneet Kaur. (IAS:MH:2014) Collector, AMRAVATI has been posted as Director, GSDA, Pune.   23. Shri.Gangatharan D, (IAS:MH:2013) Collector, Nashik has been posted as Joint Commissioner Municipal Corpn of Greater Mumbai.  24. Shri. Amol Jagannath Yedge, (IAS:MH:2014) Collector, YAVATMAL has been posted as Maharashtra State Council of Educational Research and Training (MSCERT), Pune.  25. Shri.Shanmugarajan S, (IAS:MH:2013) Collector, Washim has been posted as Additional Development Commissioner (Industries), Mumbai.  26. Shri. Vijay Chandrakant Rathod, (IAS:MH:2014) Collector, Jalna has been posted as Joint Chief Executive Officer,  Mah.Industrial Devp.Corpn.,  Mumbai.   27. Smt. Nima Arora. (IAS:MH:2014) Collector Akola has been posted as Director, Information Technology, Mumbai.  28. Shri Vaibhav Dasu Waghmare (IAS:MH:2019) has been posted as Project Officer-cum-Assistant Collector, Aheri, Gadchiroli.  29. Shri Santosh C. Patil (IAS:MH:2013) Joint Secretary to Deputy Chief Minister has been posted as Chief Executive Officer, Z.P., Kolhapur.  30. Shri R.K.Gawade (IAS:MH:2011) Chief Executive Officer, Z.P., Nandurbar has been posted as Collector, Parbhani.  31. Smt. Aanchal Goyal (IAS:MH:2014) Collector, Parbhani has been posted as Additional Municipal Commissioner, Nagpur Municipal Corporation, Nagpur.  32. Shri Sanjay Khandare, (IAS:MH:1996) has been posted as Principal Secretary, Water Supply and Sanitation Department, Mantralaya, Mumbai.  33. Shri Tukaram Mundhe, (IAS:MH:2005) Secretary, Marathi Bhasha Department, Mantralaya, Mumbai has been posted as Secretary (AD), Agriculture and ADF Department, Mantralaya, Mumbai.  34. Shri. Jalaj Sharma. (IAS:MH:2014) Collector Dhule has been posted as Collector, Nashik  35. Dr.A.N.Karanjkar (IAS:MH:2009) Commissioner, ESIS, Mumbai has been posted as Municipal Commissioner, Nashik Municipal Corporation, Nashik.  36. Shri R.S.Chavan, (IAS:MH:2013) Joint Secretary, Revenue & Forest Department, Mantralaya, Mumbai has been posted as Chief Executive Officer, Zilla Parishad, Pune.  37. Shri.Prithviraj B.P.. (IAS:MH:2014) Collector, Latur has been posted as Chief Executive Officer, SMART City, Nagpur.   38. Shri.Ruchesh Jaivanshi (IAS:MH:2009) has been posted as Chief Executive Officer, NRLM, Mumbai.  39. Shri.Milind Shambharkar,(IAS:MH:2008), Collector, Solapur has been posted as Chief Executive Officer, Mahtma Phule Jan Arogya Yojna Society, State Health Insurance Society, Mumbai.  40. Shri Makrand Deshmukh (IAS:MH:9999) Deputy Commissioner (Revenue), Konkan Division, Mumbai has been posted as Joint Secretary, Chief Secretary Office, Mantralaya, Mumbai  41. Dr.B.N.Bastewad (IAS:MH:9999) Chief General Manager (L&S), MSRDC, Mumbai has been posted as Chief Executive Officer, Z.P., Raigad.",
 "title":"Transfer order 21.07.2023.",
"publishdatetime":"21.07.2023"}
,

{"details":"Transfer order dated 17.07.2023   1. Shri M.G.Ardad, IAS (2007) Commissioner, Soil and Water Resources, Aurangabad has been posted as Divisional Commissioner, Aurangabad Division, Aurangabad.  ",
 "title":"Transfer order 17.07.2023",
"publishdatetime":"17.07.2023"}
,

{"details":"Transfer order dated 06.07.2023  1. Shri Sachindra Pratap Singh, IAS (IAS) (2007) has been posted as Chairman and Managing Director, PMPML, Pune.  2. Shri Om Prakash Bakoria (IAS) (2006) Chairman and Managing Director, PMPML, Pune has been posted as Commissioner Social Welfare, Pune.  3. Dr.Prashant Narnaware,  (IAS) (2009) Commissioner, Social Welfare, Pune has been posted as Commissioner, Women and Child, Pune  4. Smt. Vimala R., (IAS) (2009) Commissioner, Women and Child, Pune has been posted as Chief Executive Officer, M.S.Khadi Villege Industries Board, Mumbai.  ",
 "title":"Transfer order 06.07.2023",
"publishdatetime":"06.07.2023"}
,

{"details":"Transfer order dated 03.07.2023   1. Shri Ajay Gulhane, IAS (2010), Chief Executive Officer, Smart City, Nagpur has been posted as Commissioner, MGNREGS, Maharashtra, Nagpur.  2. Dr.Abhijeet Chaudhari, IAS (2011), has been posted as Municipal Commissioner, Nagpur Municipal Corporation, Nagpur.  ",
 "title":"Transfer order 03.07.2023",
"publishdatetime":"03.07.2023"}
,

{"details":"Transfer order dated 28.06.2023  1. Shri Avinash Dhakane, IAS (2010) MD, FILMCITY, Mumbai has been posted as Member Secretary, Maharashtra Pollution Control Board, Mumbai. ",
 "title":"Transfer order 28.06.2023",
"publishdatetime":"28.06.2023"}
,

{"details":"Transfer order dated 21.06.2023  1. Shri Sanjay Khandare, IAS (1996) has been posted as PS, (Civil Avaition), General Administration Department, Mantralaya, Mumbai  ",
 "title":"Transfer order 21.06.2023.",
"publishdatetime":"21.06.2023"}
,

{"details":"Transfer order dated 13.06.2023  1. Shri Rajesh Kumar, IAS (1988) ACS (RDD& PR), Rural Development Deptt has been posted as ACS (Co-operation and Marketing) Co-operation, Marketing and Textile Department, Mantralaya, Mumbai.",
 "title":"Transfer order 13.06.2023",
"publishdatetime":"13.06.2023"}
,

{"details":"Transfer order dated 07.06.2023  1. Shri Rajesh Kumar, IAS (1988) ACS (RDD& PR), Rural Development Deptt has been posted as ACS (R&R) R&FD Mantralaya, Mumbai  2. Shri Anoop Kumar, IAS (1990) ACS (Co-operation and Marketing), Co-operation, Marketing and Textile Deptt has been posted as ACS (Agri.), Agriculture and ADF Department, Mantralaya, Mumbai.  3. Dr.Rajagopal Devara, IAS (1992) ACS and Devp.Commr., Planning Dept., Mantralaya, Mumbai has been posted as ACS (Revenue, Registration and Stamp), Revenue and Forest Department, Mantralaya, Mumbai.  4. Shri Aseem Kumar Gupta, IAS (1994) PS (R&R) R&FD has been posted as PS (1), Urban Development Department, Mantralaya, Mumbai  5. Smt.Radhika Rastogi, IAS (1995) has been posted as PS (Tourism), Tourism and Cultural Affairs Department, Mantralaya, Mumbai.  6. Shri Sanjay Khandare, IAS (1996) has been posted as PS, Water Supply and Sanitation Department, Mantralaya, Mumbai  7. Shri Eknath Dawale, IAS (1997) PS (Agriculture), Agriculture and ADF Department, Mantralaya, Mumbai has been posted as PS (RDD&PR), Rural Development Department, Mantralaya, Mumbai  8. Shri Saurabh Vijay, IAS (1998) PS (Tourism), Tourism and Cultural Affairs Department, Mantralaya, Mumbai has been posted as PS and Development Commissioner, Planning Deptt., Mantralaya, Mumbai.  9. Shri R.S.Jagtap, IAS (2008) has been posted as Deputy DG, YASHADA, Pune.  10. Shri Jitendra Dudi, IAS (2016), CEO, ZP, Sangli has been posted as Collector, Satara.",
 "title":"Transfer order 07.06.2023.",
"publishdatetime":"07.06.2023"}
,

{"details":"Transfer order dated 03.06.2023   1.  Shri Anil Diggikar, IAS (1990), Vice President and Chief Execuive Officer, MHADA,  Mumbai has been posted as Vice Chairman and Managing Director, CIDCO, Mumbai   2.  Mrs.Manisha Patankar-Mhaiskar, IAS (1992), Additional chief Secretary and Chief Protocol Officer, General Administration Department, Mantralaya, Mumbai has been posted as Additional Chief Secretary, Public Works Department and Additional Charge, Additional chief Secretary and Chief Protocol Officer, General Administration Department, Mantralaya, Mumbai  3.  Dr.K.H.Govinda Raj , IAS (1995), Addl.Metropolitan Commr-2- MMRDA, Mumbai has been posted as Principal Secretary (2), Urban Development Department, Mantralaya, Mumbai  4.  Dr.Sanjay Mukherjee, IAS (1996), Vice Chairman and Managing Director, CIDCO, Mumbai  has been posted as Metropolitan Commissioner, MMRDA, Mumbai  5.  Asheesh Sharma, IAS (1997), Principal Secretary (2), Urban Development Department, Mantralaya, Mumbai has been posted as Addl.Metropolitan Commr-2- MMRDA, Mumbai  ",
 "title":"Transfer order 03.06.2023",
"publishdatetime":"03.06.2023"}
,

{"details":"Transfer order dated 02.06.2023   1. Smt.Sujata Saunik, IAS (1987) ACS  (AR&OM), GAD, Mantralaya, Mumbai has been posted as ACS (Home), Home Department, Mantralaya, Mumbai.  2. Shri S.V.R.Srinivas, IAS (1991) MC, MMRDA, Mumbai has been posted as OSD, Dharavi Redevelopment Project, Mumbai.  3. Shri Lokesh Chandra, IAS (1993) GM, BEST, Mumbai has been posted as CMD, MAHADISCOM, Mumbai.  4. Smt.Radhika Rastogi, IAS (1995) has been posted as PS & Development Commr., Planning Department, Mantralaya, Mumbai.  5. Smt.I.A.Kundan, IAS (1996) PS, Women and Child Welfare Deptt, Mantralaya, Mumbai has been posted as PS, Minority Development Department, Mantralaya, Mumbai  6. Shri Sanjeev Jaiswal, IAS (1996) PS, Water Supply and Sanitation Department, Mantralaya, Mumbai has been posted as VP and CEO, MHADA, Mumbai.  7. Shri Asheesh Sharma, IAS (1997) AMC, BMC, Mumbai has been posted as PS(2), Urban Development Department, Mantralaya, Mumbai.  8. Shri Vijay Singhal, IAS (1997) CMD, MAHADISCOM, Mumbai has been posted as GM, BEST, Mumbai.  9. Smt.Anshu Sinha, IAS (1999) CEO, M.S.Khadi Villege Industries Board, Mumbai has been posted as Secretary, OBC Bahujan Welfare Department, Mantralaya, Mumbai.  10. Shri Anup Kr.Yadav, IAS (2002) Secretary, Minority Devp.Department has been posted as Secretary, Women and Child Welfare Department, Mantralaya, Mumbai  11. Shri Tukaram Mundhe, IAS (2005) has been posted as Secretary, Marathi Bhasha Department,  Mantralaya, Mumbai.  12. Dr.Amit Saini, IAS (2007) CEO, MMB, Mumbai has been posted as Mission Director, Jal Jeevan Mission, Mumbai  13. Shri Chandrakant Pulkundwar, IAS (2008) MC, Nashik MC, Nashik has been posted as Commissioner, Sugar, Pune.  14. Dr.Manik Gursal, IAS (2009), Additional Development Commissioner (Industries) has been posted as CEO, Mah.Maritime Board, Mumbai.  15. Smt.Kadambari Balkawade, IAS (2010) MC, Kolhapur MC, Kolhapur has been posted as DG, MEDA, Pune.  16. Shri Pradipkumar Dange, IAS (2011) Jt.Secy.-cum-Mission Director, SBM (Gramin), Water Supply and Sanitation Deptt. Mantralaya, Mumbai has been posted as Director, Sericulture, Nagpur.  17. Shri Shantanu Goel, IAS (2012) Commissioner, MGNREGS, Nagpur has been posted as Joint Managing Director, CIDCO, Navi Mumbai.  18. Shri Prithviraj B.P., IAS (2014) Collector, Latur has been posted as Director, Information Technology, Mumbai.  19. Dr.Hemant Vasekar, IAS (2015) CEO, NRLM, Mumbai has been posted as Commissioner, Animal Husbandary, Pune.  20. Dr.Sudhakar Shinde, IRS (1997) has been posted as AMC, BMC, Mumbai.  ",
 "title":"Transfer order 02.06.2023.",
"publishdatetime":"02.06.2023"}
,

{"details":"Transfer order dated 19.05.2023   1. Shri Kuladeep Jangam, IAS (2020) Assistant Collector, Sillod Sub Division, Aurangabad has been posted as Assistant Collector, Deglur Sub Division, Nanded.  ",
 "title":"Transfer order 19.05.2023",
"publishdatetime":"19.05.2023"}
,

{"details":"Transfer order dated 02.05.2023   1. Dr.Nitin Kareer, IAS (1988) ACS(Revenue, Registration and Stamp), Revenue & Forest Department, Mantralaya, Mumbai has been posted as ACS (Finance), Finance Department, Mantralaya, Mumbai  2. Shri Milind Mhaiskar, IAS (1992) ACS (Civil Avaition and State Excise has been posted as ACS (1), Public Health Deptt., Mumbai  3. Shri D.T.Waghmare, IAS (1994) CMD, MAHATRANSCO, Mumbai has been posted as PS (A&S), Home Department, Mantralaya, Mumbai  4. Smt.Radhika Rastogi, IAS (1995) has been posted as Principal Secretary, Minority Devp.Department, Mantralaya, Mumbai  5. Dr.Sanjeev Kumar, IAS (2003) AMC, BMC, Mumbai has been posted as CMD, MAHATRANSCO, Mumbai  6. Shri Shravan Hardikar, IAS (2005) has been posted as AMC, BMC, Mumbai  7. Shri Tukaram Mundhe, IAS (2005) has been posted as Secretary (AD), Agri and ADF Department, Mantralaya, Mumbai  8. Shri G.Sreekanth, IAS (2009) Jt.Commissioner, State Tax, Chhatrapati Sambhaji Nagar has been posted as MC, Chhatrapati Sambhaji Nagar MC.  9. Dr.Abhijeet Chaudhari, IAS (2011) MC, Chhatrapati Sambhaji Nagar MC has been posted as Jt.Commissioner, State Tax, Aurangabad.   10. Shri P.Siva Sankar, IAS (2011) Director, Textile, Nagpur has been posted as CEO, Shri Saibaba Sansthan Trust, Shirdi.  ",
 "title":"Transfer order 02.05.2023.",
"publishdatetime":"02.05.2023"}
,

{"details":"Transfer order 28.04.2023  1. Shri Manoj Saunik, IAS (1987) Additional Chief Secretary (Finance)Finance Department has been appointed as Chief Secretary, Government of Maharashtra, Mantralaya, Mumbai.",
 "title":"Appointment as Chief Secretary-28.04.2023",
"publishdatetime":"28.04.2023"}
,

{"details":"Transfer order dated 19.04.2023   1. Smt.Jayshree Bhoj, IAS (2003) Director General, Information and Public Relation, Mumbai has been posted as Managing Director, Maharashtra Information Technology Corporation, Mumbai.  2. Shri. Shivraj S. Patil, IAS (2011) has been posted as Secretary, Maharashtra State Child Rights Commission, Mumbai.",
 "title":"Transfer order 19.04.2023.",
"publishdatetime":"19.04.2023"}
,

{"details":"",
 "title":"",
"publishdatetime":"10.04.2023"}
,

{"details":"Transfer Order dt 10.04.2023  Shri. H.S.Sonawane IAS (2010) has been posted as Inspector General of Registration and Controller of Stamp, Mumbai=",
 "title":"",
"publishdatetime":"10.04.2023"}
,

{"details":"Transfer order 31.03.2023  1. Shri Pradipkumar Dange, IAS (2010) has been posted as Joint Secretary-cum-Mission Director, Swachha Bharat Mission (Gramin), Water Supply and Sanitation Department, Mantralaya, Mumbai.",
 "title":"Transfer order 31.03.2023",
"publishdatetime":"31.03.2023"}
,

{"details":"1.Dr.Nidhi Pandey, IAS (2001), Secretary and Commissioner (Investment and Protocol), Maharashtra Sadan, New Delhi has been posted as Divisional Commissioner, Amaravati Division, Amaravati.",
 "title":"Transfer order 03.03.2023",
"publishdatetime":"03.03.2023"}
,

{"details":"1. Shri Satish G.Deshmukh, IAS (2012), Additional Controller of Stamp, Mumbai has been posted as Commissioner, Labour, Mumbai.",
 "title":"Transfer order 27.02.2022",
"publishdatetime":"27.02.2023"}
,

{"details":"Transfer order dated 22.02.2023  1 Shri Amgothu Sri Ranga Naik, IAS (2009) Jt.CEO, MIDC, Mumbai has been posted as Jt.Commissioner, GST, Mumbai.  2 Shri Anil Bhandari, IAS (2010) Jt.Commissioner, GST, Mumbai has been posted as Jt.CEO, MIDC, Mumbai.  ",
 "title":"Transfer order 22.02.2022",
"publishdatetime":"22.02.2023"}
,

{"details":"Transfer order 14.02.2023    1. Shri Rajendra Bhosale, IAS (2008) Collector, Ahmednagar has been posted as Collector, Mumbai Sub - Urban District..  2. Smt.Deepa Mudhol-Munde, IAS (2011) Chief Administer (New Township), CIDCO, Aurangabad has been posted as Collector, Beed.  3. Shri Radhabinod Sharma, IAS (2011) Collector, Beed has been posted as Chief Administer (New Township), CIDCO, Aurangabad.  4 Shri Siddharam Salimath, IAS (2011) has been posted as Collector, Ahmednagar.   5 Smt.Nidhi Choudhari, IAS (2012) Collector, Mumbai Sub-urban District, Mumbai has been posted as Joint Commissioner, Sales Tax, Mumbai.",
 "title":"Transfer order 14.02.2023",
"publishdatetime":"14.02.2023"}
,

{"details":" Transfer Order dt. 23.01.2023  1. Dr.Yogesh Patilba Mhase, IAS-2009 has been posted as Collector,Raigad.  ",
 "title":"Transfer Order dt.23.01.2023",
"publishdatetime":"24.01.2023"}
,

{"details":"Transfer order 02.01.2023  1.    Shri Dheeraj Kumar, IAS (2005) has been posted as Commissioner (FW) and Director, NHM, Mumbai.    2. Shri D.B.Gawade, IAS:2007, Jt.Secretary, Public Health Deptt. Mumbai has been posted as Secretary, State Human Right Commission, Mumbai.    3. Dr.Mahendra Kalyankar  - IAS:2007, Collector, Raigad has been posted as Divisional Commissioner, Konkan Division, Mumbai.",
 "title":"Transfer order 02.01.2023",
"publishdatetime":"02.01.2023"}
,

{"details":"1. Rajesh Patil - IAS:OR:2005, Director, Sainik Kalyan, Pune has been posted as Joint Managing Director, CIDCO, Navi Mumbai.    2. Ashwin A. Mudgal - IAS:2007, Joint Managing Director, CIDCO, Navi Mumbai  has been posted as Addl. Metropolitan Commissioner, MMRDA,Mumbai.    3. Ajay Annasaheb Gulhane, IAS:2010 has been posted as CEO, Nagpur Smart City,  Nagpur And Additional Charge of Additional Municipal Commissioner, Nagpur Municipal Corporation, Nagpur    4. Deepak Singla, IAS:2012 has been posted as Additional Commissioner, PMRDA Pune.    5. Bhagyashree Banayat - IAS:NL:2012 has been posted as Additional Municipal Commissioner, Nashik Municipal Corporation, Nashik    6. Dr.Indurani Jakhar, IAS:2016 has been posted as Managing Director, MAVIM,  Mumbai    IAS Transfer dt. 30.12.2022",
 "title":"Transfer Order Dated 30.12.2022",
"publishdatetime":"30.12.2022"}
,

{"details":"IAS Transfer Order dt. 15.12.2022  1. Shri. Chinmay Gotmare, IAS :AM- 2009 Chief Executive officer, Nagpur Smart City, Nagpur has been posted as Collector, Gondia.   2. Smt Nayana Arjun Gunde, IAS-2010 Collector, Gondia has been posted as Tribal Commissioner, Nashik.  3. Shri H.S.Sonwane, IAS-2010  Commissioner, Tribal Development, Nashik has been posted as Dairy Development Commissioner, Mumbai.  ",
 "title":"Transfer Order dt.15.12.2022",
"publishdatetime":"15.12.2022"}
,

{"details":"IAS Transfer Order  dt. 09.12.2022  1. Shri. Nitin  Patil,IAS-2007, Commissioner, Human Development, Aurangabad has been posted as Special Commissioner, Sales Tax, Mumbai.   2. Smt. Bhagyashree Banayat, IAS:NL:2012 has been posted as Additional Divisional Commissioner, Nashik Division, Nashik.  ",
 "title":"Transfer Order dt. 09.12.2022",
"publishdatetime":"09.12.2022"}
,

{"details":"IAS Transfer dt. 29.11.2022  1. Shri.Tukaram Mundhe,IAS-2005 has been transferred from Commissioner, Family Welfare and Director, NHM, Mumbai.   2. Dr V.N. Suryawanshi, IAS-2006, Additional Commissioner, MMRDA, Mumbai has been posted as Commissioner, Excise,  Mumbai.  3. Smt. Bhagyashree Banayat, IAS NL:2012, Chief Executive Officer, Shri Saibaba Sansthan Trust, SHIRDI  has been posted as Member Secretary, Vidharbha Statutory Development Board, Nagpur  4. Shri Vinay Sadashiv Moon,  IAS-2011, Chief Executive Officer, Z.P., Bhandara has been posted as Chief Executive Officer, Z.P., Parbhani  5. Shri. Sunil S Chavan, IAS-2007 has been posted as Commissioner, Agriculture, Pune   6. Shri. S.M Kurtkoti, IAS-2013 has been posted as Chief Executive Officer, Z.P., Bhandara  7. Smt.Saumya Sharma,  IAS-2018,  Assistant Collector, Deglur Sub Division Nanded has been posted as Chief Executive Officer, Z.P., Nagpur       ",
 "title":"Transfer Order dt 29.11.2022",
"publishdatetime":"29.11.2022"}
,

{"details":"Transfer order 17.11.2022  1. Smt.Sheetal Ugale-Teli, IAS (MH:2009) Director, Textile, Nagpur has been posted as Municipal Commissioner, Solapur Municipal Corporation, Solapur  2 Shri P.Sivasankar, IAS (MH:2011) Municipal Commissioner, Solapur Municipal Corporation, Solapur has been posted as Director, Textile, Nagpur.  3 Shri S.Ramamamoorthy, IAS (MH:2013) has been posted as Joint Commissioner, MMRDA, Mumbai  4. Shri Yogesh Kumbhejkar, IAS (MH:2016) CEO, ZP, Nagpur has been posted as Collector, Bhandara.  5. Shri Bhagyashree Vispute, IAS (MH:2017) CEO, ZP, Buldhana has been posted as CEO, ZP, Nagpur.  6. Shri S.M.Kurtkoti, IAS (MH:9999) has been posted as CEO, ZP, Buldhana.  ",
 "title":"Transfer order 17.11.2022",
"publishdatetime":"17.11.2022"}
,

{"details":"Transfer order 07.11.2022  1. Shri.Virendra Singh, IAS (MH:2006), has been posted as Secretary (Textile), Co-operation, Marketing and Textile Deptt., Mantralaya. Mumbai.",
 "title":"Transfer order 07.11.2022",
"publishdatetime":"07.11.2022"}
,

{"details":"Transfer order 03.11.2022  1. Shri.Ashish Kumar Singh, IAS (MH:1988), Additional Chief Secretary (Transport & Ports), Home Deptt., Mantralaya has been posted as Additional Chief Secretary (Accounts & Treasury), Finance Deptt., Mantralaya.  2. Smt.Abha Shukla, IAS (MH:1993), Principal Secretary (Accounts & Treasury), Finance Deptt., Mantralaya has been posted as Principal Secretary (Energy), Industries, Energy & Labour Deptt., Mantralaya.  3. Shri.Dinesh T.Waghmare, IAS (MH:1994), Principal Secretary (Energy), Industries, Energy & Labour Deptt., Mantralaya has been posted as Chairman & M.D., M.S. Electricity Transmission Company Ltd., Mumbai.  4. Shri.Parrag Jain Nainutia, IAS (MH:1996), Principal Secretary (Textiles), Co-Op., Marketing & Textiles Deptt., Mantralaya has been posted as Principal Secretary (Transport & Ports), Home Deptt., Mantralaya and Additional Charge of Principal Secretary (I.T.), General Administration Deptt., Mantralaya.  ",
 "title":"Transfer Order Dated 03.11.2022",
"publishdatetime":"03.11.2022"}
,

{"details":"Transfer order 21.10.2022  1. Smt.Prerna Deshbhratar, IAS (MH:2010) has been posted as Joint Commissioner, Sales Tax, Mumbai  2. Shri Deepak Singla, IAS (MH:2012) has been posted as AMC, PMRDA, Pune  ",
 "title":"Transfer order 21.10.2022",
"publishdatetime":"21.10.2022"}
,

{"details":"Transfer order 14.10.2022  1. Shri Omprakash Bakoria, IAS (MH:2006) has been posted as CMD, PMPML, Pune  2. Shri H.P.Tummod, IAS (MH:2008) Dairy Development Commissioner Mumbai has been posted as Collector, Buldana.  3. Shri S.T.Taksale, IAS (MH:2011) CEO, ZP, Parbhani has been posed as CEO, Mahtma Phule Jan Arogya Yojna Society, State Health Assurance, Mumbai.  ",
 "title":"Transfer order 14.10.2022",
"publishdatetime":"14.10.2022"}
,

{"details":"IAS Transfer dt. 12.10.2022  1. Smt. Mittali Sethi , IAS-2017 has been posted as Director, Vanamati, Nagpur.  2. Shri. Virendra Singh, IAS-2006 Commissioner, Medical Education, Mumbai  has been posted as M.D., Maha. I.T. Coporation, Mumbai.  3. Shri. Sunil Chavan, IAS-2007 Collector,  Aurangabad  has been posted as Development Commissioner (Un-Organised Labour), Mumbai.  4. Shri. Ajay Gulhane, IAS-2010 Collector,  Chandrapur has been posted as Additional Muncipal Commissioner, Nagpur.  5. Shri. Deepak Kumar Meena, IAS-2013 Additional Municipal Commissioner, Nagpur has been posted as Additional Tirbal Commissioner, Thane.  6. Shri. Vinay Gowda, IAS-2015 CEO Z.P.  Satara has been posted as Collector,  Chandrapur ..  7. Shri. R K Gawade, IAS-2011 CEO Z.P.  Nandurbar has been posted as Additional Chief Elctoral Officer, Mumbai.  8. Shri. Manik Gursal, IAS-2009 has been posted as Additional Commissioner (Industries).  9. Shri. Shivraj Srikant Patil, IAS-2011 Joint MD CIDCO, Mumbai has been posted as M.D., MAHANAND Mumbai.  10. Shri. Astik Kumar Pandey, IAS-2011 has been posted as Collector,  Aurangabad   11. Smt. Leena Bansod, IAS-2015 has been posted as M.D., M S Co-Op Tribal Deve. Corp. Nashik  12. Shri. Deepak Singla, IAS-2012 M.D., M S Co-Op Tribal Deve. Corp. Nashik  has been posted Joint Commissioner MMRDA, Mumbai.  13. Shri. L S Mali, IAS-2009,  Secretary, Fee Regulatory Authority Mumbai  has been posted as Director, OBC Bahujan Welfare Directorate, Pune.  14. Shri. S C Patil, IAS-9999 has been posted Joint Secretary, Deputy Chief Minister Office Mantralaya.  15. Shri. D K Khilari, IAS-9999 Joint Inspector General of Stamps has been posted as CEO Z.P.  Satara.  16. Shri. S K Salimath IAS-2011 CEO, ZP Palghar has been posted as  Joint M.D., CIDCO, Mumbai.  17. Shri. S M Kurtkoti, IAS-9999 has been posted as CEO, ZP Nandurbar.  18. Shri. R D Nivatkar, IAS-2010 Collector Mumbai has been posted as Commissioner, Medical Education, Mumbai and Additional Charge of Collector Mumbai.  19. Shri. B H Palawe IAS-9999 Addl. Commissioner Divisional Commissioner, Nashik has been posted as CEO, ZP Palghar.  20. Shri. R S Chavan IAS-9999 has been posted as  Joint Secretary, Revenue Stamps and Forest Dept. Mantralaya, Mumbai.  ",
 "title":"Transfer Order dt 12.10.2022",
"publishdatetime":"12.10.2022"}
,

{"details":"1. .Smt.Leena Bansod (IAS:MH:2015).Chief Executive Officer, Nashik.has been posted as.Additional Commissioner, Tribal development, Thane    2. .Shri Vivek Johnson  (IAS:MH:2018).Assistant Collector, and Project Officer, ITDP, Pandharkawada Yavatmal.has been posted as.Chief Executive Officer, Zilla Parishad, Chandrapur    3. .Shri Abhijeet Raut,  (IAS:MH:2013).Collector, Jalgaon .has been posted as.Collector, Nanded    4. .Dr.Ramaswami N. (IAS:AM:2004) .Commissioner (FW) and Director, NHM, Mumbai.has been posted as.Commissioner, Skill Development, Employment and Entrp. Navi Mumbai.    5. .Dr.Harshdeep Shriram Kamble, (IAS:MH:1997).Development Commissioner (Industries) Directorate of Industries.has been posted as.Principal Secretary, Industries,Mantralya,Mumbai    6. .Smt. Jayashree S Bhoj, (IAS:MH:2003).Managing Director   Mah. Tourism Development Corpn, MUMBAI .has been posted as.DG, DGIPR and additional charge of MD, Maha IT corporation    7. .Shri.Parimal Singh, (IAS:MH:2004).Commissioner, Food & Drugs Administration,  MUMBAI .has been posted as.Project Director, Nanaji Deshmukh Krishi Sanjivanee Project, Mumbai.    8. .Shri A.R.Kale (IAS:MH:2005).Managing Director, MAHANAND, Mumbai. .has been posted as.Commissioner, Food & Drugs Administration, MUMBAI    9. .Shri Rajesh Narvekar (IAS:MH:2009).Collector, Thane.has been posted as.Municipal Commissioner Navi-Mumbai Municipal Corpn.    10. .Shri.Abhijeet Bangar,  (IAS:MH:2008).Municipal Commissioner  Navi-Mumbai Municipal .has been posted as.Municipal Commissioner  Thane Municipal Corporation    11. .Dr.Vipin Sharma,  (IAS:MH:2005).Municipal Commissioner Thane Municipal Corporation.has been posted as.Chief Executive Officer, MIDC, Mumbai.    12. .Shri. Neelesh Ramesh Gatne, (IAS:MH:2012).Chief Executive Officer Z.P.   AURANGABAD .has been posted as.Chief Executive Officer, SRA, Pune.    13. .Shri Saurabh Vijay, (IAS: MH: 1998) .Secretary, Medical Education and Drug Department, Mantralaya. .has been posted as.Secretary, Cultural and Tourism Department, Mantralaya, Mumbai    14. .Shri.Milind Borikar (IAS MH:2010).Director Tourism  MUMBAI .has been posted as.Chief Officer  Mumbai Hsg. & Area Devp.Board    15. .Shri.Avinash Dhakane (IAS MH:2010).Transport Commissioner.has been posted as.Managing Director  M.S.Film Stage & Cult.Devpt.,    16. .Shri.Sanjay Khandare (IAS MH:1996).Chairman & M.D.  M.S.Power Generation Co.Ltd..has been posted as.Principal Secretary -1 Public Health Department,    17. .Dr.Anbalagan P (IAS:MH:2001).Chief Executive Officer, MIDC, Mumbai .has been posted as.Chairman & M.D.  M.S.Power Generation Co.Ltd.    18. .Shri.Deepak kapoor,  (IAS:MH:1991).Vice Chairman &  MD, Mah.Airport Devp. Company Ltd., MUMBAI. .has been posted as.Additional Chief Secretary, Water Resources  Department  Mantralaya,  MUMBAI    19. .Smt.Valsa Nair, IAS,  (IAS:MH:1991).Principal Secretary  Tourism, Civil Aviation and State Excise  Mantralaya,  MUMBAI. .has been posted as.Principal Secretary   Housing Department   Mantralaya,  MUMBAI    20. .Smt.Manisha Patankar-Mhaiskar, (IAS:MH:1992).Principal Secretary, Environment and Climate Change Deptt., Mantralaya, Mumbai.has been posted as.Principal Secretary  and Chief Protocol Officer, Mantralaya, Mumbai and additional charge of Marathi Bhasha Deparment    21. .Milind Mhaiskar  (IAS :MH:1992) .Principal Secretary Housing Department Mantralaya, MUMBAI.has been posted as.Principal Secretary, Civil Aviation, General administration Department, Mumbai & additional charge principal secretary State Excise    22. .Pravin Chindhu Darade (IAS :MH:1998) .Managing Director  MSSIDC  MUMBAI..has been posted as.Secretary (Environment), Mantralaya, Mumbai. and additional Charge of Member Secretary, Maharashtra Pollution Control Board    23. .Shri.Tukaram Mundhe (IAS :MH:2005) .Secretary, State Human Rights Commission   MUMBAI..has been posted as.Commissioner (FW) and Director, NHM, Mumbai.    24. .Shri Anup Kumar Yadav, (IAS:MH: 2002) . Secretary, Tribal Development Department, Mantralaya, Mumbai..has been posted as.Secretary Minority Development Department     25. .Dr.Pradeep Kumar Vyas  (IAS :MH:1989) .Additional Chief  Secretary -1 Public Health Department, Mantralaya. .has been posted as.Additional Chief  Secretary, Tribal Development Department, Mantralaya, Mumbai.    26. .Dr.Ashwini Joshi (IAS:MH:2006).Development Commissioner (Un-Organised Labour), Mumbai.has been posted as.Secretary,  Medical Education and Drug Department, Mantralaya.    27. .Shri Deependra Singh Kushwah (IAS:MH:2006).Commissioner, Skill Development, Employment and Entrp. Navi Mumbai..has been posted as.Development Comissioner, (Industries).     28. .Shri Ashok Shingare  IAS (2009) .Member Secretary, Maharashtra Pollution Control Board, Mumbai.has been posted as.Collector,Thane    29.  Smt.Shraddha Joshi (IRS:2007)  Member Secretary, Maharashtra State Women Commission, `Mumbai. .has been posted as.MD, Maharashtra Tourism Development Corporation     30. .Shri Manuj Jindal (IAS:MH:2017).Chief Executive Officer, Zilla Parishad, Jalna..has been posted as.Chief Executive Officer, Zilla Parishad, Thane.    31. .Shri Sachin Ombase (IAS:MH:2015).Chief Executive Officer, Zilla Parishad, Wardha..has been posted as.Collector, Osmanabad    32. .Shri Aman Mittal (IAS:MH:2015).Municipal Commissioner, Latur Municipal Corpn., Latur.has been posted as.Collector, Jalgaon     33. .Shri.Rajesh Patil  (IAS: OR:2005).On Compulsory Wait..has been posted as.Director, Sainik Welfare, Pune.    34. .Smt.Ashima Mittal (IAS:MH:2018).Project Officer, ITDP, Dahanu and Assistant Collector, Dahanu, Palghar.has been posted as.Chief Executive Officer, Zilla Parishad, Nashik    35. .Shri Keerthi Kiran H Pujar  (IAS:MH:2018) .Project Officer, ITDP, Kinwat and Asst.Collector, Kinwat, Nanded..has been posted as.Chief Executive Officer, Zilla Parishad, Ratnagiri    36. .Shri Rohan Ghuge (IAS:MH:2018).Assistant Collector and PO, ITDP, Chandrapur .has been posted as.Chief Executive Officer, Zilla Parishad, Wardha    37. .Shri Vikas Meena  (IAS:MH:2018).Assistant Collector and  Project Officer, ITDP, Kalwan, Nashik.has been posted as.Chief Executive Officer, Zilla Parishad, Aurangabad    38. .Smt. Varsha Meena  (IAS:MH:2018).Assistant Collector and  Project Officer, ITDP, Nashik, Nashik.has been posted as.Chief Executive Officer, Zilla Parishad, Jalna    39. .Shri.K.V.Jadhav (IAS:MH:2010) .On Compulsory Wait.has been posted as.Joint Managing Director, MSRDC, Mumbai     40. .Shri Kaustubh Diwegaonkar ,  (IAS:MH:2013).Collector, Osmanabad.has been posted as.Project Director, Balasaheb Thakre Agri Business and Rural Development Project, Pune      41. .Shri. Rajendra Nimbalkar (IAS:MH:2007) .Chief Executive Officer, Slum Rehabilatation Authority, Pune.has been posted as.Managing Director   MSSIDC    42. .Shri. Vivek L. Bhimanwar (IAS:MH:2009).Managing Director, M.S.Film M.S.Film Stage & Cult.Devpt.  Dadasaheb Phalke Chitranagari,  Mumbai. .has been posted as.Transport Commissioner, Government of Maharashtra, Mumbai    43. .Dr.Bhagawantrao Namdeo Patil. (IAS:MH:2014) .Collector, Ratnagiri.has been posted as.Director, Tourism,   Mumbai.    44. .M.Devender Singh. (IAS:MH:2011) .Director MSCERT PUNE .has been posted as.Collector, Ratnagiri  ",
 "title":"Transfer Order dated 29.09.2022",
"publishdatetime":"30.09.2022"}
,

{"details":"Subject :- Posting of Officers in the office of GST Council Secretariat on deputation basis-regarding.     Ministry of Finance, New Delhi has invided nominations for the following posts  1. Director - Pay Matrix 13 - 02 posts.  2. Deputy Secretary-Pay Matrix 12 - 02 posts.  3. Under Secretary - Pay Matrix 11 - 04 posts    Interested officers are requested to contact Under Secretary, General Administration Department, Mantralaya, Mumbai. (Tel.No.022-22874955 or 22793205) for further details.    Sd/-  Under Secretary to the  Government of Maharashtra",
 "title":"Posting of Officers in the office of GST Council Secretariat on deputation basis-regarding.",
"publishdatetime":"08.09.2022"}
,

{"details":"Transfer order 01.09.2022  1. Shri Om Prakash Bakoria, IAS (MH:2006) Commissioner, Sports and Youth, Pune  has been posed as MD, MTDC, Mumbai.  2. Shri S.K.Diwase, IAS (MH:2009) has been posed as Commissioner, Sports and Youth, Pune.  3. Shri Astik Kumar Pandey, IAS (MH:2011) has been posed as Addl.Commissioner, PMRDA, Pune.  ",
 "title":"Transfer order 01.09.2022",
"publishdatetime":"02.09.2022"}
,

{"details":"Transfer order 18.08.2022  1. Shri Rahul Ranjan Mahiwal, IAS (MH:2005) Commissioner, Women and Child Welfare, Pune has been posted as Metropolitan Commissioner, PMRDA, Pune.  2. Smt.Vimala R., IAS (MH:2009) Collector, Nagpur has been posted as Commissioner, Women and Child Welfare, Pune   3. Shri Vipin Itankar, IAS (MH:2014) Collector, Nanded has been posted as Collector, Nagpur.  4. Shri Rahul Kardile, IAS (MH:2015), Joint Commissioner, MMRDA, Mumbai has been posted as Collector, Wardha.  ",
 "title":"Transfer order 18.08.2022",
"publishdatetime":"18.08.2022"}
,

{"details":"Transfer order 16.08.2022    1. Smt. Jayashree Bhoj, IAS (2003), M.D., Maharashtra Tourism Development Corporation, Mumbai  has been posted as M.D., Maharashtra Information Technology Corporation, Mumbai.  2. Shri. Rajesh Patil, IAS (OR:2005),  Municipal Commissioner, Pune-Chinchwad Municipal Corporation, Pimpari-Pune has been posted as M.D., Maharashtra Tourism Development Corporation, Mumbai.  3. Shri. Madan Nagargoje, IAS (MP:2007), M.D., Haffkine Bio-Pharma Corporation, Mumbai has been posted as M.D., Lokshahir Anna Bhau Sathe Development Corporation, Mumbai.  4. Smt.Suman Chandra, IAS (2010) has been posted as M.D., Haffkine Bio-Pharma Corporation, Mumbai.   5. Shri. Shekhar Singh, IAS (2012) has been posted as Municipal Commissioner, Pune-Chinchwad Municipal Corporation, Pimpari-Pune.  ",
 "title":"Transfer Order 16.08.2022",
"publishdatetime":"16.08.2022"}
,

{"details":"Subject :- Inviting applications for the post of Executive Director in REC Limited on deputation.     REC Limited  has invited nominations for the post of Executive Director in REC Limited .    Interested officers are requested to contact Under Secretary, General Administration Department, Mantralaya, Mumbai. (Tel.No.022-22874955 or 22793205) for further details.    Sd/-  Under Secretary to the  Government of Maharashtra",
 "title":"Inviting applications for the post of Executive Director in REC Limited on deputation.",
"publishdatetime":"10.08.2022"}
,

{"details":"Subject :- Filling up the post of Officer on Special Duty on deputation basisi in ITPO.     India Trade Promotion Organisation,  New Delhi has invided nominations for the post of Officer on Special Duty.    Interested officers are requested to contact Under Secretary, General Administration Department, Mantralaya, Mumbai. (Tel.No.022-22874955 or 22793205) for further details.    Sd/-  Under Secretary to the  Government of Maharashtra",
 "title":"Filling up the post of Officer on Special Duty on deputation basisi in ITPO. ",
"publishdatetime":"10.08.2022"}
,

{"details":"Transfer order 05.08.2022  1. Smt.Vijayalakshmi Prasana-Bidari, IAS (MH:2001) has been posted as Divisional Commissioner, Nagpur Division, Nagpur.  2. Dr.V.N.Suryawanshi, IAS (MH:2006) has been posted as AMC, MMRDA, Mumbai.  3. Shri Sushil Khodwekar, IAS (MH:2011) has been posted as Member Secretary, Rest of Maharashtra Staturoty Development Board, Mumbai.  ",
 "title":"Transfer order 05.08.2022",
"publishdatetime":"05.08.2022"}
,

{"details":"Transfer order 20.07.2022  1. Dr.B.A.Gagarani, IAS (MH:1990) ACS (1), UDD, Mantralaya, Mumbai has been posted as ACS to Chief Minister, Mantralaya, Mumbai.  2. Dr.D.D.Pandharpatte, IAS (MH:2004) Secretary, Soil and WC Deptt, has been posted as Divisional Commissioner, Amaravati Division, Amaravati.  ",
 "title":"Transfer order 20.07.2022",
"publishdatetime":"20.07.2022"}

]