[

{"details":"Transfer order 18.08.2022  1. Shri Rahul Ranjan Mahiwal, IAS (MH:2005) Commissioner, Women and Child Welfare, Pune has been posted as Metropolitan Commissioner, PMRDA, Pune.  2. Smt.Vimala R., IAS (MH:2009) Collector, Nagpur has been posted as Commissioner, Women and Child Welfare, Pune   3. Shri Vipin Itankar, IAS (MH:2014) Collector, Nanded has been posted as Collector, Nagpur.  4. Shri Rahul Kardile, IAS (MH:2015), Joint Commissioner, MMRDA, Mumbai has been posted as Collector, Wardha.  ",
 "title":"Transfer order 18.08.2022",
"publishdatetime":"18.08.2022"}
,

{"details":"Transfer order 16.08.2022    1. Smt. Jayashree Bhoj, IAS (2003), M.D., Maharashtra Tourism Development Corporation, Mumbai  has been posted as M.D., Maharashtra Information Technology Corporation, Mumbai.  2. Shri. Rajesh Patil, IAS (OR:2005),  Municipal Commissioner, Pune-Chinchwad Municipal Corporation, Pimpari-Pune has been posted as M.D., Maharashtra Tourism Development Corporation, Mumbai.  3. Shri. Madan Nagargoje, IAS (MP:2007), M.D., Haffkine Bio-Pharma Corporation, Mumbai has been posted as M.D., Lokshahir Anna Bhau Sathe Development Corporation, Mumbai.  4. Smt.Suman Chandra, IAS (2010) has been posted as M.D., Haffkine Bio-Pharma Corporation, Mumbai.   5. Shri. Shekhar Singh, IAS (2012) has been posted as Municipal Commissioner, Pune-Chinchwad Municipal Corporation, Pimpari-Pune.  ",
 "title":"Transfer Order 16.08.2022",
"publishdatetime":"16.08.2022"}
,

{"details":"Subject :- Inviting applications for the post of Executive Director in REC Limited on deputation.     REC Limited  has invited nominations for the post of Executive Director in REC Limited .    Interested officers are requested to contact Under Secretary, General Administration Department, Mantralaya, Mumbai. (Tel.No.022-22874955 or 22793205) for further details.    Sd/-  Under Secretary to the  Government of Maharashtra",
 "title":"Inviting applications for the post of Executive Director in REC Limited on deputation.",
"publishdatetime":"10.08.2022"}
,

{"details":"Subject :- Filling up the post of Officer on Special Duty on deputation basisi in ITPO.     India Trade Promotion Organisation,  New Delhi has invided nominations for the post of Officer on Special Duty.    Interested officers are requested to contact Under Secretary, General Administration Department, Mantralaya, Mumbai. (Tel.No.022-22874955 or 22793205) for further details.    Sd/-  Under Secretary to the  Government of Maharashtra",
 "title":"Filling up the post of Officer on Special Duty on deputation basisi in ITPO. ",
"publishdatetime":"10.08.2022"}
,

{"details":"Transfer order 05.08.2022  1. Smt.Vijayalakshmi Prasana-Bidari, IAS (MH:2001) has been posted as Divisional Commissioner, Nagpur Division, Nagpur.  2. Dr.V.N.Suryawanshi, IAS (MH:2006) has been posted as AMC, MMRDA, Mumbai.  3. Shri Sushil Khodwekar, IAS (MH:2011) has been posted as Member Secretary, Rest of Maharashtra Staturoty Development Board, Mumbai.  ",
 "title":"Transfer order 05.08.2022",
"publishdatetime":"05.08.2022"}
,

{"details":"Transfer order 20.07.2022  1. Dr.B.A.Gagarani, IAS (MH:1990) ACS (1), UDD, Mantralaya, Mumbai has been posted as ACS to Chief Minister, Mantralaya, Mumbai.  2. Dr.D.D.Pandharpatte, IAS (MH:2004) Secretary, Soil and WC Deptt, has been posted as Divisional Commissioner, Amaravati Division, Amaravati.  ",
 "title":"Transfer order 20.07.2022",
"publishdatetime":"20.07.2022"}
,

{"details":"Transfer order 12.07.2022  1. Dr.Shrikar Pardeshi, IAS (2001) has been posted as Secreary to Honble Deputy Chief Minister,  2. Shri Bhausaheb Dangade (2011) CEO, ZP, Thane has been posted as Municipal Corporation, Kalyan-Dombivali Municipal Corporation, Mumbai.  ",
 "title":"Transfer order 12.07.2022",
"publishdatetime":"12.07.2022"}
,

{"details":"1. Smt. Deepa Mudhol Munde, IAS Chief Administrator (New Township), CIDCO, Aurangabad  (MH:2011)  has been posted as  Collector Sangli.  2. Shri Astik kumar Pandey, IAS (MH:2011)Muncipal Commissioner Aurangabad,   has been posted as Chief Administrator (New Township), CIDCO, Aurangabad.  3. Dr. Abhijit Chaudhari  IAS (2011) Collector Sangli has been posted as Muncipal Commissioner Aurangabad.  ",
 "title":"Transfer order 29.06.2022",
"publishdatetime":"29.06.2022"}
,

{"details":"Transfer order 31.05.2022  1. Smt.Sujata Saunik, IAS (1987) ACS (Services), GAD, Mantralaya, Mumbai has been posted as ACS (AR&OM). GAD, Mantralaya, Mumbai.  2. Shri Nitin Gadre., IAS (1989) ACS (A&S), Home Deptt, Mantralaya, Mumbai has been posted as ACS (Services), GAD, Mantralaya, Mumbai.  ",
 "title":"Transfer order 31.05.2022",
"publishdatetime":"31.05.2022"}
,

{"details":"Transfer order 24.05.2022  1. Shri Asheesh Sharma, IAS (1997) has been posted as Additional Municipal Commissioner,Greater Mumbai Municipal Corporation, Mumbai.  2. Smt.Vanmathi C., IAS (2015) has been posted as Joint Commissioner, Sales Tax, Mumbai.",
 "title":"Transfer order 24.05.2022",
"publishdatetime":"24.05.2022"}
,

{"details":"1. Shri A.R.Kale, IAS (MH:2005)  has been posted as MD,M.S.Co-op Dairy Fedration, Mumbai.  2. Shri Sawan Kumar, IAS (MH:2019)Assistant Collector, Pusad sub Division Yavatmal has been posted as Project officer ITDC and Assistant Collector,  Dharani sub Division Amaravati.  3. R.B. Bhagade IAS (2009) Managing Director Mah.State Farming Corpn., Pune has been posted as Member Secretary,Mah Council of Agri Educt & Re., Pune.  4. V. V.  Mane., IAS (2009) Member Secretary,Mah Council of Agri Educt & Re., Pune. has been posted as Managing Director Mah.State Farming Corpn., Pune.  ",
 "title":"IAS Transfer order 11.05.2022",
"publishdatetime":"12.05.2022"}
,

{"details":"Dr. Sonia Sethi, IAS (1994)Addl.Metropolitan Commr-1-MMRDA, Mumbai has been posted to Principle Secretary, 2 Urban Development Department, Mantralaya, Mumbai.",
 "title":"Transfer Order dt 10.05.2022",
"publishdatetime":"12.05.2022"}
,

{"details":"Transfer order 05.05.2022  1. Shri A.B.Dhulaj, IAS (MH:2009) Commissioner, Employment State Insurance Scheme, Mumbai has been posted as MD< MAIDC, Mumbai.  2. Shri A.N.Karanjkar, IAS (MH:2009) MD, MAIDC, Mumbai has been posted as Commisioner, Employment State Insurance Scheme, Mumbai.   3. Smt.Buvenswari S., IAS (2015) DG, VANAMATI, Nagpur has been posted as Chief Executive Officer, Zilla Parishad, Dhule.  4. Smt.Vanmathi C., IAS (2015) Chief Executive Officer, Zilla Parishad, Dhule has been posted as Commissioner, State Common Entrance Exam Cell, Mumbai.  5. Shri Ashish Yerekar, IAS (2018) Assistant Collector and PO, ITDP, Gadchiroli has been posted as Chief Executive Officer, Zilla Parishad, Ahmednagar.  6. Shri Madan Nagargoje, IAS(MP:2007), Joint Secretary, OBC Bahujan Welfare Department, Mantralaya, Mumbai has been posted as MD, Haffkine Bio-Pharma Corporation, Mumbai.  ",
 "title":"Transfer order 05.05.2022",
"publishdatetime":"05.05.2022"}
,

{"details":"Transfer order 20.04.2022  1. Shri Ranjit Singh Deol, IAS (AM:1998) has been posted as Secretary, School Education and Sports Department, Mantralaya, Mumbai,  2. Smt.Soumya Sharma, IAS (MH:2018) has been posted as Assistant Collector, Deglur Sub Division, Dist.Nanded.  3. Smt.Vaishanvi B., IAS (MH:2019) has been posted as Assistant Collector, Tumsar Sub Division, Dist.Bhandara.  4. Smt.Shradha Joshi, IRS(2007), MD, MAVIM, Mumbai has been posted as Member Secretary, Mah.State Women Commission, Mumbai.  ",
 "title":"Transfer order 20.04.2022",
"publishdatetime":"20.04.2022"}
,

{"details":"Transfer order 13.04.2022  1. Shri Chinmay Gotmare, IAS (AM:2009) has been posted as CEO, Smart City, Nagpur,  2. Shri K.V.Jadhav, IAS (MH:2010) has been posted as Commissioner, Maharashtra Common Entrance Exam Cell, Mumbai.  ",
 "title":"Transfer order 13.04.2022",
"publishdatetime":"13.04.2022"}
,

{"details":"Transfer order 11.04.2022  1. Smt.Madhvi Khode-Chawre, IAS (2007), MD, Haffkine Bio-Pharma Corporation has been posted as Additional Divisional Commissioner, Nagpur Division, Nagpur.  2. Shri Vishal Solanki, IAS (AM:2005), has been posted as Deputy Director General, YASHADA, Pune.  3. Shri Chinmay Gotmare (AM:2009) Dy Director General, YASHADA, Pune has been posted as Commissioner, Maharashtra Common Entrance Exam Cell, Mumbai.  4. Shri C.K.Dange, IAS (2010), Project Director. M.S.AIDS Control Society has been posted as Jt.Managing Director, MAHADISCOM, Kalyan.    ",
 "title":"Transfer order 11.04.2022",
"publishdatetime":"11.04.2022"}
,

{"details":"Transfer order 01.04.2022  1. Dr. Rajagopal Devara, IAS (1992) PS (Reforms), Finance Deptt, Mantralaya, Mumbai has been posted as Principal Secretary and Development Commissioner, Planning Department, Mantralaya, Mumbai.  2. Smt. Shaila, IAS (2003), Special Commissioner, Sales Tax, Maharashtra, Mumbai has been posted as Secretary (Reforms), Finance Deptt, Mantralaya, Mumbai.  3. Shri Vivek Bhimanwar, IAS (2009), JS (IT) has been posted as MD, FILMCITY, Mumbai.  4. Shri M.V.Mohite, IAS (2011), JS, Rural Development Department, Mumbai has been posted as Managing Director, Annasaheb Patil Arthik Vikas Mahamandal, Mumbai.  ",
 "title":"Transfer order 01.04.2022",
"publishdatetime":"01.04.2022"}
,

{"details":"Transfer order 11.03.2022  1. Shri N R Gadre, IAS (1989) Additional Chief Secretary (Accounts & Treasury )  Finance Department has been posted as Additional Chief Secretary (Appeals & Security), Home Department.  2. Smt.Abha Shukla, IAS (1993) has been posted as Principal Secretary (Accounts & Treasury), Finance Department.   3.Shri. Sumant Bhange, IAS (2003) Secretary (SDC) and SEO II, General Administration Deptt. has been posted as Secretary, Social Justice And Special Assistant Department.   4. Shri.Kailash Pagare, IAS (2010) Managing Director, Filmcity, Mumbai has been posted as State Project Director Samgra Siksha Abhiyan,, Mumbai.  ",
 "title":"Transfer order 11.03.2022",
"publishdatetime":"11.03.2022"}
,

{"details":"Transfer order 10.03.2022  1. Shri Suraj Mandhare, IAS (2010) Collector, Nashik has been posted as Commissioner, Education, Pune.  2.Shri Rajendra Kshirsagar, IAS (2011), CEO, ZP, Ahmednagar has been posted as JS to Chief Secretary Office, Mantralaya, Mumbai.   ",
 "title":"Transfer order 10.03.2022",
"publishdatetime":"10.03.2022"}
,

{"details":"Transfer order 09.03.2022  1.Dr. Sanjay Chahande, IAS (1988) has been posted as ACS (AR&OM), GAD,  2.Shri A.M.Limaye, IAS (1989), ACS (A&S) has been posted as ACS (Home), Home Deptt.,  3. Shri S.A.Tagade, IAS (1991), has been posed as PS (A&S), Home Deptt.,  4. Smt.Abha Shukla, IAS (1993), PS (IT) has been posted as PS, Social Justice and Special Assistance Deptt.  5.Dr.Amit Saini, IAS (2007), CEO, MMB, Mumbai has been posted as Jt.Secretary, Chief Secretary, Mantralaya, Mumbai,  6. Shri R.S.Jagtap, IAS (2008), Commissioner, State Common Entrance Exam Cell has been posted as DG, MEDA, Pune,  7. Shri Vivek Bhimanwar, IAS (2009)Jt.Secretary (IT) has been posted as MD, M.S.Horticulture and Drugs Plant, Pune.  8.Shri Rahul Dwivedi, IAS (2010) Project Director, Samgra Siksha Abhyian has been posted as Joint Commissioner, Sales Tax, Mumbai.   9. Shri Gangatharan D., IAS (2013) Dy.Secreary, Chief Secretary has been posted as Collector, Nashik.  ",
 "title":"Transfer order 09.03.2022",
"publishdatetime":"09.03.2022"}
,

{"details":"Subject :- application for the post of Chairman and Managing Director, HMT Limited, Bengaluru..reg.     Ministry of Heavy Industries, New Delhi has invided nominations for the post of Chairman and Managing Director, HMT Limited Bengaluru.    Interested officers are requested to contact Under Secretary, General Administration Department, Mantralaya, Mumbai. (Tel.No.022-22874955 or 22793205) for further details.    Sd/-  Under Secretary to the  Government of Maharashtra",
 "title":"Application for the post of Chairman and MD, HMT Ltd., Bengaluru.",
"publishdatetime":"14.02.2022"}
,

{"details":"Transfer order dated 04.02.2022    1. Shri. Samir Kumar Biswas, IAS (1990), has been posted as Resident Commissioner and Principal Secretary, Maharashtra Sadan, New Delhi.  2. Smt.Madhvi Khode-Chaware, IAS (2007) has been posted as Managing Director, Haffkine Bio-Pharma Corporation, Mumbai.  ",
 "title":"Transfer order 04.02.2022",
"publishdatetime":"04.02.2022"}
,

{"details":"Transfer order dated 31.01.2022    1. Shri. Nand Kumar, IAS (1989), has been posted as Additional Chief Secretary, OBC Bahujan Welfare Department  Mantralaya, Mumbai.  ",
 "title":"Transfer order 31.01.2022",
"publishdatetime":"31.01.2022"}
,

{"details":"Transfer order dated 21.12.2021  1. Shri D.D.Pandharpatte, IAS(MH:2004), DG, I&PR has been posted as Secretary, Soil and Water Conservation Department,Mantralaya, Mumbai.",
 "title":"Transfer order 21.12.2021",
"publishdatetime":"21.12.2021"}
,

{"details":"Subject :- Filling up the post of Chairman, SEBI.       Ministry of Finance, Department of Economic Affairs, New Delhi has invided nomination for the post of Chairman, SEBI.     Interested officers are requested to contact Under Secretary, General Administration Department, Mantralaya, Mumbai. (Tel.No.022-22874955 or 22793205) for further details.      Sd/-  Under Secretary to the  Government of Maharashtra",
 "title":"Filling up the post of Chairman, SEBI.",
"publishdatetime":"15.11.2021"}
,

{"details":"Subject :- Filling up the post of Member -Administration- in the Adjudicating Authority under the Prevention of Money Laundering Act, 2002.      Ministry of Finance, Department of Revenue, New Delhi has invided nominations for the post of Member (Administration)  in the Adjudicating Authority under the Prevention of Money Laundering Act, 2002.    Interested officers are requested to contact Under Secretary, General Administration Department, Mantralaya, Mumbai. (Tel.No.022-22874955 or 22793205) for further details.      Sd/-  Under Secretary to the  Government of Maharashtra",
 "title":"Filling up the post of Member -Administration- in the Adjudicating Authority under the Prevention of Money Laundering Act, 2002.",
"publishdatetime":"12.11.2021"}
,

{"details":"Subject :- Filling up the post of Director-Printing- in the Directorate of Printing.      Ministry of Housing and Urban Affairs, New Delhi has invided nominations for the post of Director (Printing) in the Directorate of Printing in pay Level-13A.    Interested officers are requested to contact Under Secretary, General Administration Department, Mantralaya, Mumbai. (Tel.No.022-22874955 or 22793205) for further details.      Sd/-  Under Secretary to the  Government of Maharashtra",
 "title":"Filling up the post of Director-Printing- in the Directorate of Printing.",
"publishdatetime":"03.11.2021"}
,

{"details":"Subject :- Vacancy circular for appointment on deputation basis to the post of Member-Power-, Narmada Control Authority, Indore.      Department of Water Resources, New Delhi has invided nominations for the post of Member (Power), Narmada Control Authority, Indore on deputation basis.    Interested officers are requested to contact Under Secretary, General Administration Department, Mantralaya, Mumbai. (Tel.No.022-22874955 or 22793205) for further details.      Sd/-  Under Secretary to the  Government of Maharashtra",
 "title":" Vacancy circular for appointment on deputation basis to the post of Member-Power-, Narmada Control Authority, Indore.",
"publishdatetime":"02.11.2021"}
,

{"details":"Transfer order dated 26.10.2021    1. Dr.Sanjay Chahande (IAS:1988) has been posted as Additional Chief Secretary, OBC Bahujan Welfare Department, Mumbai.  2. Shri S.A.Tagade (IAS:MH:1991) has been posted as MD, MPCL, Mumbai.  3. Shri Pankaj Kumar (IAS:MH:2002) has been posted as MD, Mah.State Fishries Development Corporation, Mumbai.  ",
 "title":"Transfer order 26.10.2021",
"publishdatetime":"26.10.2021"}
,

{"details":"Transfer order dated 20.10.2021    1. Shri Sanjeev Jaiswal (IAS:1996) has been posted as Principal Secretary, Water Supply and Sanitation Department, Mumbai.  2. Shri Abhishek Krishna (IAS:MH:2006) Joint Chief Executive Officer, MIDC, Mumbai has been posted as Member Secretary, Maharashtra Jivan Pradhikaran, Mumbai.",
 "title":"Transfer order 20.10.2021",
"publishdatetime":"20.10.2021"}
,

{"details":"Subject :- Invitation of applications for the post of Member, Odisha Electricity Regulatory Commission.      Department of Energy, Government of Odisha has invided nominations for the post of Member, Odisha Electricity Regulatory Commission.     Interested officers are requested to contact Under Secretary, General Administration Department, Mantralaya, Mumbai. (Tel.No.022-22874955 or 22793205) for further details.      Sd/-  Under Secretary to the  Government of Maharashtra",
 "title":"Invitation of applications for the post of Member, Odisha Electricity Regulatory Commission.",
"publishdatetime":"14.10.2021"}
,

{"details":"Subject :- Filling up the post of Director in Dr.Ambedkar Foundation.      Ministry of Social Justice and Empowermenr, New Delhi has invited nominations of officer for the post of Director in Dr.Ambedkar Foundation.    Interested officers are requested to contact Under Secretary, General Administration Department, Mantralaya, Mumbai. (Tel.No.022-22874955 or 22793205) for further details.      Sd/-  Under Secretary to the  Government of Maharashtra",
 "title":"Filling up the post of Director in Dr.Ambedkar Foundation.",
"publishdatetime":"14.10.2021"}
,

{"details":"Transfer Order dated 06.10.2021  1. Shri.Virendra Singh (IAS:MH:2006) has been posted as Commissioner, Medical Education, Mumbai     ",
 "title":"Transfer Order dated 06.10.2021",
"publishdatetime":"06.10.2021"}
,

{"details":"1. Shri.R.S.Jagtap, (IAS:MH:2008) has been posted as Commissioner, State Common Entrance Exam Cell, Mumbai  2. Shri.K.S.Pagare, (IAS:MH:2010), Controller of Rationing and Director, Civil Supply, Mumbai has been posted as Managing Director, Filmcity, Mumbai  3. Shri.K.H.Bagate, (IAS:MH:2011) has been posted as Controller of Rationing and Director, Civil Supply, Mumbai.  4. Shri.C.D.Joshi, (IAS:MH:2012), Commissioner, State Common Entrance Exam Cell, Mumbai has been posted as Director, Groundwater Survey Development Agency, Pune  5. Smt.Buveneswari S., (IAS:MH:2015) Chief Executive Officer, Nagpur Smart City, Nagpur has been posted as Director General, VANAMATI, Nagpur  ",
 "title":"Transfer Order dated 23.09.2021",
"publishdatetime":"23.09.2021"}
,

{"details":"1. Shri. N.K.Patil, (IAS:MH:2007), M.D., M.S.Co-Op. Tribal Development Co-Operation Ltd., Nashik has been posted as Commissioner, Human Development, Aurangabad  2. Dr. C.L.Pulkundwar, (IAS:MH:2008), Joint M.D., MSRDC, Mumbai has been posted as Director (Disaster Management), Revenue & Forest Department, Mantralaya, Mumbai  3. Shri.L.S.Mali, (IAS:MH:2009), Director (Disaster Management), Revenue & Forest Department, Mantralaya, Mumbai has been posted as Secretary, Fee Regulatory Authority, Mumbai  4. Smt.Kavita Dwivedi, (IAS:MH:2011), Additional Metropolitan Commissioner, PMRDA, Pune has been posted as Municipal Commissioner, Akola Municipal Corporation, Akola  5. Shri.Pradeep Kumar Dange, (IAS:MH:2011) has been posted as M.D., Mahatma Jyotiba Phule Research and Training Institute (Mahajyoti), Nagpur  6. Shri.Deepak Singla, (IAS:MH:2012), Member Secretary, Vidarbha Statutory Development Board, Nagpur has been posted as M.D., M.S.Co-Op. Tribal Development Co-Operation Ltd., Nashik  7. Smt.Bhagyashree Banayat, (IAS:NL:2012), Director, Sericulture, Nagpur has been posted as C.E.O., Shri Saibaba Sansthan Trust, Shirdi  ",
 "title":"Transfer Order dated 1.9.2021",
"publishdatetime":"01.09.2021"}
,

{"details":"Subject :- Filling up two vacancies of Joint Directors at Joint Secretary Level and six vacancies of Deputy Directors at Deputy Secretary Level in the Academy.        LBSNAA, Mussoorie has invited nominations of officer for the posts of two vacancies of Joint Directors at Joint Secretary Level and six vacancies of Deputy Directors at Deputy Secretary Level in the Academy.               Interested officers are requested to contact Under Secretary, General Administration Department, Mantralaya, Mumbai immediately before 16.01.2018 positively. (Tel.No.022-22874955 or 22793205) for further details.    Sd/-    Under Secretary to the    Government of Maharashtra",
 "title":"Filling up two vacancies of Joint Directors at Joint Secretary Level and six vacancies of Deputy Directors at Deputy Secretary Level in the Academy. ",
"publishdatetime":"27.08.2021"}
,

{"details":"Subject :- Filling up the post of Member-Power-, Narmada Control Authority, Indore.        Ministry of Jal Shakti, New Delhi has invited nominations of officer for the post of Member (Power), Narmada Control Authority, Indore.    Interested officers are requested to contact Under Secretary, General Administration Department, Mantralaya, Mumbai immediately before 16.01.2018 positively. (Tel.No.022-22874955 or 22793205) for further details.        Sd/-    Under Secretary to the    Government of Maharashtra",
 "title":"Filling up the post of Member-Power-, Narmada Control Authority, Indore. ",
"publishdatetime":"27.08.2021"}
,

{"details":"Subject :- Filling up the posts of Chairperson and three full time members of the National Financial Reporting Authority.        Ministry of Corporate Affairs, New Delhi has invited nominations of officer for the posts of Chairperson and three full time members of the National Financial Reporting Authority.    Interested officers are requested to contact Under Secretary, General Administration Department, Mantralaya, Mumbai immediately before 16.01.2018 positively. (Tel.No.022-22874955 or 22793205) for further details.        Sd/-    Under Secretary to the    Government of Maharashtra",
 "title":"Filling up the posts of Chairperson and three full time members of the National Financial Reporting Authority. ",
"publishdatetime":"27.08.2021"}
,

{"details":"Subject :- Filling up the post of Director General and CEO in the Indian Institute of Corporate Affairs,       Ministry of Corporate Affairs, New Delhi has invited nominations of officer for deputation to the post of Director General and CEO, Indian Institute of Corporate Affairs,     Interested officers are requested to contact Under Secretary, General Administration Department, Mantralaya, Mumbai immediately before 16.01.2018 positively. (Tel.No.022-22874955 or 22793205) for further details.        Sd/-    Under Secretary to the    Government of Maharashtra",
 "title":"Filling up the post of Director General and CEO in the Indian Institute of Corporate Affairs,",
"publishdatetime":"27.08.2021"}
,

{"details":"Transfer order dated 26.08.2021    1.  Shri Anil Patil  (Additional Collector Cadre: Select List:2019)Managing Director, Annasaheb Patil Arthik Vikas Mahamandal Ltd. Mumbai has been posted as CEO, ZP, Gondia.",
 "title":"Transfer order 26.08.2021",
"publishdatetime":"26.08.2021"}
,

{"details":"Transfer order dated 24.08.2021    1.  Shri Jayshree Bhoj (IAS:MH:2003) MD, Maharashtra Information Technology Corporation, Mumbai has been posted as Managing Director, MTDC, Mumbai.    2.  Dr.Nirupama Dange (IAS:MH:2007) has been posted as Assistant Resident Commissioner, Maharashtra Sadan, New Delhi.    3.  Shri Milind Borikar (IAS:MH:2010) Collector, Mumbai Sub-urban District, Mumbai has been posted as Director, Tourism, Mumbai.    4.   Smt. Nidhi Choudhari (IAS:MH:2012) has been posted as Collector, Mumbai Sub-urban District, Mumbai.  ",
 "title":"Transfer order 24.08.2021",
"publishdatetime":"24.08.2021"}
,

{"details":"  Transfer order dated 20.08.2021    1.             Dr.Mahendra Kalyankar, IAS(2007) has been posted as Collector, Raigad.    2.             Shri M.B.Warbhuwan, IAS(2010) Jt.Secretary, GAD, Mantralaya, has been posted as Additional Tribal Commissioner, Thane.    3.             Shri Sanjay Meena, IAS(2011) Additional Tribal Commissioner, Thane has been posted as Collector, Gadchiroli    4.             Shri Nidhi Choudhari (IAS:MH:2012) Collector, Raigad has been posted as Director, IT, Mumbai.    5.             Shri Deepak Singla, IAS(2012) Collector, Gadchiroli has been posted as Member Secretary, Vidharbha Statutory Development Board, Nagpur.    6.             Shri Ajit Kumbhar, IAS(2015) Chief Executive Officer, Zilla Parishad, Beed has been posted as Jt.Commissioner, Greater Mumbai Municipal Corporation.    7.             Shri Ajit Pawar (Additional Collector Cadre: Select List:2019)President, District Caste Scrutiny Committee, Pune has been posted as Chief Executive Officer, Zilla Parishad, Beed.    8.             Shri Sanjay Daine (Additional Collector Cadre: Select List:2019)President, District Caste Scrutiny Committee, Gondia has been posted as Chief Executive Officer, Zilla Parishad, Hingoli.        ",
 "title":"Trqansfer order 20.08.2021",
"publishdatetime":"20.08.2021"}
,

{"details":"G.A.D. / X      Willingness for the Central Deputation for the Year-2021.    Subject :- Inviting nominations of officers of the Indian Administrative Service for appointment to posts of Joint Secretary - Director - Deputy Secretary on Central Deputation during the year 2021.       Department of Personnel & Training, New Delhi has invited nominations of officers for deputation to the posts under Central Staffing Scheme (CSS) and for the posts of Chief Vigilance Officers (CVOs) in Central Public Sector Enterprises (CPSEs) as well as in other organizations under central Ministries / Departments during the year 2021 vide their D.O. letter No.32/2021-EO (MM.II), dated 04.06.2021 from Deputy Secretary, Government of India, DoPT, New Delhi to the Chief Secretaries of all the State & D.O.No. 32/2021-EO (MM.II), dated 15.12.2020 from under Secretary, Government of India, DoPT, New Delhi.      The detailed guidelines are displayed by DoPT on their website https://dopt.gov.in.    Interested officers of 1995-2012 Batches are requested to apply online on DoPT’s website https://supremo.nic.in as per their seniority [1995-2005 (Joint Secretary Level), 2006-2008 (Director Level), 2009-2012 (Deputy Secretary Level)] and send their application along with Bio-Data to Joint Secretary, General Administration Department, Mantralaya, Mumbai immediately.    In case of any difficulty contact Desk-X, General Administration Department, Mantralaya, Mumbai [ Phone No. 022-22874955 / 022-22793205 ].                                      Sd/-                         [ Shelesh Nawal ]   Joint Secretary to Government of Maharashtra    ",
 "title":"Inviting nominations of officers of the Indian Administrative Service for appointment to posts of Joint Secretary - Director - Deputy Secretary on Central Deputation during the year 2021.",
"publishdatetime":"20.08.2021"}
,

{"details":"    Transfer order dated 11.08.2021    1.  Smt.Manisha Verma (IAS:MH:1993) MD, FILMCITY, Mumbai has been posted as Principal Secretary, Skill Development and Entrepreneurship Deptt.Mantralaya, Mumbai.    2.  Shri Radhabinod Aribam Sharma (IAS:MH:2012) CEO, ZP, Hingoli has been posted as Collector, Beed.    3.  Dr.M.M.Gondavale (IAS:MH:2015) CEO, ZP, Aurangabad has been posted asJt.Managing Director, MAHADISCOM, Aurangabad.    4.  Shri Neelesh R. Gatne (Additional Collector Cadre: (Select List:2019) President, District Caste Scrutiny Committee, Palghar has been posted as CEO, ZP, Aurangabad.        With regards,    Ajit Patil  Joint Secretary,  Govt. of Maharashtra,  022-22023461    ",
 "title":"Transfer order 11.08.2021",
"publishdatetime":"11.08.2021"}
,

{"details":"Subject :      Filling up the post of Administrative Officer in National Test House, Kolkata.         Ministry of Consumer Affairs and Food, Public Distribution, Department of Consumer Affairs has invited the Nominations for the posts of Administrative Officer in National Test House, Kolkata.         Interested officers are requested to contact Under Secretary, General Administration Department, Mantralaya, Mumbai immediately before 16.01.2018 positively. (Tel.No.022-22874955 or 22793205) for further details.              Sd/-    Section Officer to the    Government of Maharashtra     ",
 "title":"Filling up the post of Administrative Officer in National Test House, Kolkata.",
"publishdatetime":"05.08.2021"}
,

{"details":"Subject :      Filling up the posts of Whole Time Member, Securities and Exchange Board of India.         Ministry of Finance, Department of Economic Affairs has invited the Nominations for the posts of Whole Time Member, Securities and Exchange Board of India.         Interested officers are requested to contact Under Secretary, General Administration Department, Mantralaya, Mumbai immediately before 16.01.2018 positively. (Tel.No.022-22874955 or 22793205) for further details.              Sd/-    Section Officer to the    Government of Maharashtra",
 "title":"Filling up the posts of Whole Time Member, Securities and Exchange Board of India.",
"publishdatetime":"05.08.2021"}
,

{"details":"Subject :      Filling up the post of Director General and Chief Executive Officer in Indian Institute of Corporate Affairs.              Ministry of Corporate Affairs has invited the Nominations for the post  of Director General and Chief Executive Officer in the Indian Institute of Corporate Affairs.         Interested officers are requested to contact Under Secretary, General Administration Department, Mantralaya, Mumbai immediately before 16.01.2018 positively. (Tel.No.022-22874955 or 22793205) for further details.              Sd/-    Section Officer to the    Government of Maharashtra",
 "title":"Filling up the post of Director General and Chief Executive Officer in Indian Institute of Corporate Affairs..",
"publishdatetime":"05.08.2021"}
,

{"details":"Subject : Filling up the post of Internal Financial Adviser at Nuclear Recycle Board, BARC, Mumbai.       Ministry of Personnel, Public Grievances and Pensions, Department of Personnel and Training, New Delhi has invited the name of filling up the post of Internal Financial Adviser at Nuclear Recycle Board, BARC, Mumbai under the Department of Atomic Energy on deputation basis.     Interested officers are requested to contact Under Secretary, General Administration Department, Mantralaya, Mumbai. (Tel.No.022-22874955 or 22793205) for further details.     Sd/-  Section Officer to the  Government of Maharashtra  ",
 "title":"Filling up the post of Internal Financial Adviser at Nuclear Recyvle Board, BARC, Mumbai. ",
"publishdatetime":"29.07.2021"}
,

{"details":"Subject : Filling of the post of Chief Executive Officer in the Goods and Services Tax Network, New Delhi.     Goods and Services Tax Network, New Delhi has invited willing officers for appointment as Chief Executive Officer (CEO) in the Goods and Services Tax Network (GSTN), New Delhi on deputation basis.     Interested officers are requested to contact Under Secretary, General Administration Department, Mantralaya, Mumbai immediately before 05.09.2021 positively. (Tel.No.022-22874955 or 22793205) for further details.      Sd/-  Section Officer to the  Government of Maharashtra  ",
 "title":"Filling of the post of Chief Executive Officer in the Goods and Services Tax Network, New Delhi. ",
"publishdatetime":"28.07.2021"}
,

{"details":"Transfer order dated 23.07.2021    1. Shri J. P. Gupta (IAS:MH:1993) Principal Secretary, OBC Bahujan Welfare Department, Mantralaya, Mumbai has been posted as Principal Secretary (ADF), Agriculture and ADF Department, Mantralaya, Mumbai.  ",
 "title":"Tranfer order 23.07.2021",
"publishdatetime":"23.07.2021"}
,

{"details":"Transfer order dated 22.07.2021    1.  Shri Arvind Kumar (IAS:MH:1985) Additional Chief Secretary (Co-operation), Co-operation, Marketing and Textile Department has been posted as Additional Chief Secretary, Social Justice and Special Assistance Deptt., Mantralaya, Mumbai.  2.  Shri Anoop Kumar (IAS:MH:1990) Principal Secretary (ADF), Agriculture and ADF Department, Mantralaya, Mumbai has been posted as Principal Secretary (Co-operation and Marketing), Co-operation, Marketing and Textile Department, Mantralaya, Mumbai.   ",
 "title":"Transfer order 22.07.2021",
"publishdatetime":"23.07.2021"}
,

{"details":"Subject : Filling of the posts of Joint Directors –2-Posts- and Deputy Director -6 Posts- in LBSNAA.     LBSNAA has invited the Nominations for the 2 posts as Joint Directors (Jt.Secy.Level) and 6 posts as Deputy Directors (Director and Deputy Secretary Level) in the Academy    Interested officers are requested to contact Under Secretary, General Administration Department, Mantralaya, Mumbai immediately before 16.01.2018 positively. (Tel.No.022-22874955 or 22793205) for further details.      Sd/-  Section Officer to the  Government of Maharashtra  ",
 "title":"Filling of the posts of Joint Directors –2-Posts- and Deputy Director -6 Posts- in LBSNAA. ",
"publishdatetime":"16.07.2021"}
,

{"details":"Transfer order dated 13.07.2021    1.  Shri O.P.Gupta (IAS:MH:1992) Principal Secretary, Higher & Technical Education Department, Mantralaya, Mumbai has been posted as Principal Secretary (Expenditure), Finance Deptt., Mantralaya, Mumbai.  2.  Shri Vikas Chandra Rastogi (IAS:MH:1995) Principal Secretary (A.R.& O.M.), General Administration Department, Mantralaya, Mumbai has been posted as Principal Secretary, Higher & Technical Education Department, Mantralaya, Mumbai.   3.  Smt.Indra Mallo, (IAS:MH:1999) Commissioner, Integrated Child Development Scheme, Navi Mumbai has been posted as Principal Secretary (A.R.& O.M.), General Administration Department, Mantralaya, Mumbai.  4.  Shri Ajit Patil (IAS:KL:2007) Joint Secretary, General Administration Department, Mantralaya, Mumbai has been posted as Joint Chief Executive Officer, MIDC, Mumbai.  5.  Smt.Rubal Prakher-Agarwal (IAS:MH:2008) Additional Municipal Commissioner, Pune Municipal Corporation, Pune has been posted as Commissioner, ICDS, Navi Mumbai.  6.  Shri Daulat Desai (IAS:MH:2008) Collector, Kolhapur has been posted as Joint Secretary, Medical Education and Drugs Deptt., Mumbai.  7.  Shri Ruchesh Jaivanshi (IAS:MH:2009) Collector, Hingoli has been posted as Commissioner, Women and Child, Pune.  8.  Shri Sanjay Yadav (IAS:MH:2009) has been posted as Jt.MD, MSRDC, Mumbai  9.  Shri Shelesh Nawal (IAS:MH:2010) Collector, Amaravati has been posted as Deputy Secretary, General Administration Department, Mantralaya, Mumbai.  10.  Shri R.H.Thakare (IAS:MH:2010) has been posted as Additional Tribal Commissioner, Nagpur.  11.  Shri J.S.Papalkar (IAS:MH:2010) Collector, Akola has been posted as Municipal Commissioner, Akola Municipal Corporation, Akola.  12.  Shri G.M.Bodke   (IAS:MH:2010) Joint Managing Director, Maharashtra State Electricity Distribution Company, Kalyan has been posted as Collector, Hingoli.  13.  Shri Rahul Ashok Rekhawar   (IAS:MH:2011) Managing Director, M.S.Seed Corporation, Akola has been posted as Collector, Kolhapur  14.  Shri Ravindra Binwade (IAS:MH:2012) Collector, Jalna has been posted as Additional Municipal Commissioner, Pune Municipal Corporation, Pune.  15.  Shri Deepak Kumar Meena (IAS:MH:2013) has been posted as Additional Municipal Corporation, Nagpur Municipal Corporation, Nagpur.  16.  Smt. Pavneet Kaur (IAS:MH:2014) Commissioner, Tribal Research and Training Institute, Pune has been posted as Collector, Amaravati.  17.  Shri. Vijay Chandrakant Rathod  (IAS:MH:2014) Additional Controller of Stamps, Mumbai has ben posted as Collector, Jalna.  18.  Smt.Nima Arora (IAS:MH:2014) Municipal Commissioner, Akola Municipal Corporation, Akola has been posted as Collector, Akola.  19.  Smt.Aanchal Goyal (IAS:MH:2014) Jt.Managing Director, M.S.Film, Stage and Cultural Development Corporation, Mumbai has been posted as Collector, Parbhani  20.  Dr.B.N.Patil  (IAS:MH:2014) has been posted as Collector, Ratnagiri.  ",
 "title":"Transfer order 13.07.2021",
"publishdatetime":"13.07.2021"}
,

{"details":"Transfer order dated 09.07.2021    1.  Shri V.B.Patil, IAS (MH:2000) Secretary, Food, Civil Supplies and Consumer Protection Department, Mantralaya, Mumbai has been posted as Divisional Commissioner, Konkan Division, Mumbai.  2.  Shri Vijay Waghmare,  IAS (2004) Joint Managing Director, MSRDC, Mumbai has been posted as Secretary, Food, Civil Supplies and Consumer Protection Department, Mantralaya, Mumbai.  3.  Smt.Nayana Gunde,  IAS (2008) Dy.,DG, YASHADA, Pune has been posted as Collector, Gondia.   4.      Smt.Vimala R.,  IAS (2009) has been posted as Collector, Nagpur.  5.  Shri Laxminarayan Mishra,  IAS (2012) Collector, Ratnagiri has been posted as Chairman and Managing Director, Pune Mahanagar Parivahan Mahamandal Limited, Pune.  6.  Dr.Rajendra Bharud,  IAS (2013) Collector, Nandurbar has been posted Commissioner, Tribal Research and Training Institute, Pune.  7.  Shri Jalaj Sharma,  IAS (2014) Additional Municipal Commissioner, Nagpur Municipal Corporation, Nagpur has been posted as Collector, Dhule  8.  Smt.Manisha Khatri, IAS (2014) Additional Commissioner, Tribal Development, Nagpur has been posted as Collector, Nandurbar  ",
 "title":"Transfer order 09.07.2021",
"publishdatetime":"10.07.2021"}
,

{"details":"Transfer order dated 02.07.2021    1. Shri Shubham Gupta, IAS (MH:2019)  has been posted as Project Officer, Integrated Tribal Development Project, Bhamragad, Dist: Gadchiroli and Assistant Collector, Yattapali, Dist: Gadchiroli  2. Smt.Trupti Dhodmise, IAS (MH:2019)  has been posted as Project Officer, Integrated Tribal Development Project, Dhule, Dist: Dhule and Assistant Collector, Dhule, Dist: Dhule  3. Dr.Mainak Ghosh, IAS (MH:2019)  has been posted as Project Officer, Integrated Tribal Development Project, Dist: Nandurbar and Assistant Collector, Taloda, Dist: Nandurbar  4. Smt.Manisha Awhale, IAS (MH:2019)  has been posted as Project Officer, Integrated Tribal Development Project, Solapur Dist: Solapur and Assistant Collector, Solapur, Dist: Solapur.  5. Shri Ankit, IAS (MH:2019)  has been posted as Project Officer, Integrated Tribal Development Project, Aheri Dist: Gadchiroli and Assistant Collector, Aheri, Dist: Gadchiroli  6. Smt.Minal Karanwal, IAS (MH:2019)  has been posted as Project Officer, Integrated Tribal Development Project, Nandurbar Dist: Nandurbar and Assistant Collector, Nandurbar, Dist: Nandurbar  7. Shri Sawant Kumar, IAS (MH:2019)  has been posted as Project Officer, Integrated Tribal Development Project, Pusad Dist: Yavatmal and Assistant Collector, Pusad, Dist: Yavatmal  8. Shri Vaibhav Waghmare, IAS (MH:2019)  has been posted as Project Officer, Integrated Tribal Development Project, Dharni Dist:   Amaravati and Assistant Collector, Dharni, Dist: Amaravati  9. Shri Anmol Sagar,  IAS (MH:2019)  has been posted as Project Officer, Integrated Tribal Development Project, Deori Dist: Gondia and Assistant Collector, Deori, Dist: Gondia   10. Smt.Ayushi Singh, IAS (MH:2019) has been posted as Project Officer, Integrated Tribal Development Project, Jawhar Dist: Palghar and Assistant Collector, Jawhar, Dist: Palghar  ",
 "title":"Transfer order 02.07.2021",
"publishdatetime":"05.07.2021"}
,

{"details":"Transfer order dated 01.07.2021    1.  Smt.Anshu Sinha, IAS (MH:1999) Secretary, Skill Development and Enterpurnership Department, has been posted as CEO, M.S.Khadi & Villege Industries Board, Mumbai.  2.  Dr.Nitin Jawale , IAS (OR:2003) has been posted as Managing Director, SICOM, Mumbai.  ",
 "title":"Transfer order 01.07.2021",
"publishdatetime":"01.07.2021"}
,

{"details":"Transfer order dated 30.06.2021    1.  Shri. Praveen Pardeshi,  IAS (1985) has been posted as Additional Chief Secretary, Marathi Bhasha Department, Mumbai.  2.  Shri. Ranjit Kumar,  IAS (2008) Director (IT), Mantralaya, Mumbai has been posted as Joint Secretary to Chief Secretary Office, Mantralaya,   3.  Shri V.P.Phad, IAS (MH:2011) CEO, ZP, Osmanabad has been posted as Member Secretary, Marathwada Statutory Development Board, Aurangabad.  4.  Dr.Pankaj Ashiya, IAS (MH:2016) Municipal Commissioner, Bhiwandi-Nijampur Municipal Corporation, Bhiwandi has been posted as CEO, ZP, Jalgaon.  5.  Shri Rahul Gupta, IAS (MH:2017) Assistant Collector and Project Officer, ITDP, Aheri, Gadchiroli has been posted as CEO, ZP, Osmanabad.  6.  Shri Manuj Jindal, IAS (MH:2017) Assistant Collector, Attapali Sub Division and Project Officer, ITDP, Bhamragad, Gadchiroli has been posted as CEO, ZP, Jalna.  7.  Smt.Mitali Sethi, IAS (MH:2017) Assistant Collector and Project Officer, ITDP, Dharni, Amaravati has been posted as CEO, ZP, Chandrapur.  ",
 "title":"Transfer order 30.06.2021",
"publishdatetime":"30.06.2021"}
,

{"details":"Transfer order dated 25.06.2021    1. Shri A.L.Jarhad, IAS (1997) Secretary to Chief Minister, Mantralaya, Mumbai has been posted as Chairman, Maharashtra Pollution Control Board, Mumbai.   ",
 "title":"Transfer order 25.06.2021",
"publishdatetime":"25.06.2021"}
,

{"details":"Transfer order dated 22.06.2021    1. Smt.Prajkta Verma, IAS (2001), Secretary, Marathi Bhasha Department, Mumbai has been posted as Divisional Commissioner, Nagpur Division, Nagpur.  ",
 "title":"Transfer order 22.06.2021",
"publishdatetime":"22.06.2021"}
,

{"details":"Transfer order dated 07.06.2021    1.  Shri. Sanjeev Jaiswal, IAS (1996) Additional Municipal Commissioner, Greater Mumbai Municipal Corporation, Mumbai has been posted as Managing Director, Maharashtra State Fisheries Development Corporation, Mumbai.    2.  Dr.Sanjeev Kumar, IAS (2003) Divisional Commissioner, Nagpur Division, Nagpur has been posted as Additional Municipal Commissioner, Greater Mumbai Municipal Corporation, Mumbai.    3. Smt.Shaila A, IAS (2003) has been posted as Special Sales Tax Commissioner, Maharashtra State, Mumbai.",
 "title":"Transfer order 07.06.2021",
"publishdatetime":"07.06.2021"}
,

{"details":"Transfer order dated 03.06.2021    1.    Shri. S.V.R.Srinivas, IAS (1991) Principal Secretary, Housing Department, Mantralaya, Mumbai has been posted as Metropolitan Commissioner, MMRDA, Mumbai.    2.    Shri. Milind Mhaiskar, IAS (1992) Principal Secretary (Forest), Revenue & Forest Department, Mantralaya, Mumbai has been posted as Principal Secretary, Housing Department, Mantralaya, Mumbai.    3.    Shri. Lokesh Chandra,  IAS (1993) Principal Secretary (AR&OM), General Administration Department, Mantralaya, Mumbai has been posted as General Manager, BEST, Mumbai.    4.    Shri. B.Venugopal Reddy, IAS (1994) Managing Director, SICOM, Mumbai has been posted as Principal Secretary (Forest), Revenue & Forest Department, Mantralaya, Mumbai.    5.    Shri Vikas Chandra Rastogi, IAS (MH:1995), Project Director, Nanaji Deshmukh Krishi Sanjeevani Project, Mumbai has been posted as Principal Secretary (AR&OM), General Administration Department, Mantralaya, Mumbai.    6.    Shri S.N.Bhange, IAS (MH:2003), Managing Director, Maharashtra State Fishries Development Corporation, Mumbai has been posted as Secretary (SDC) and Special Enquiry Officer (2), General Administration Department, Mantralaya, Mumbai.    7.    Dr.Shrikar Pardeshi, IAS (MH:2001) has been posted as Managing Director, SICOM, Mumbai.    8.    Shri Deepak Kumar Meena, IAS (MH:2013) Collector, Gondia has been posted as Deputy Secretary, Bahujan Welfare and OBC Department, Mantralaya, Mumbai.  ",
 "title":"Transfer order 03.06.2021",
"publishdatetime":"03.06.2021"}
,

{"details":"  Transfer order dated 04.05.2021     1.    Shri A. R. Kale, IAS(2005) has been posted as Deputy Secretary, Medical Education & Drugs Department, Mumbai.    2.    Dr. Ashwini Madhukar Joshi, IAS(2006) has been posted as Development Commissioner (Un-Organised Labour), Mumbai.    3.    Shri Hrishikesh Yashod, IAS (UP:2006) has been posted as Mission Director, Jal Jivan Mission, Mumbai.    4.    Shri Chinmay Gotmare, IAS(AM:2009) has been posted as Deputy Director General, YASHADA, Pune.    5.    Shri M.V. Mohite, IAS(2011) has been posted as Joint Secretary, Rural Development Department, Mumbai.    6.    Shri Vijay Chandrakant Rathod, IAS(2014) has been posted as Additional Controller of Stamps, Mumbai.    7.    Shri Rahul Gupta, IAS(2017) Assistant Collector and P. O. ITDP, Aheri, Gadchiroli has been posted as Chief Executive Officer, Zilla Parishad, Jalna.",
 "title":"Transfer order 04.05.2021",
"publishdatetime":"10.05.2021"}
,

{"details":"Transfer order 20.04.2021.  1. Shri Parimal Singh, IAS (2004), Special Sales Tax Commissioner, Maharashtra State, Mumbai has been posted as Commissioner, Food and Drugs Administration, Mumbai.",
 "title":"Transfer order 20.04.2021",
"publishdatetime":"22.04.2021"}
,

{"details":"Transfer order dated 26.03.2021    1.    Shri. Lokesh Chandra,  IAS (1993) has been posted as Principal Secretary (AR&OM), General Administration Department, Mantralaya, Mumbai.    2.    Shri. Rajeev Kumar Mital, IAS (1998) Secretary (Expenditure), Finance Department, Mantralaya, Mumbai has been posted as Commissioner, Sales Tax, Maharashtra State, Mumbai.    3.    Shri Amol Yedge, IAS (MH:2014), CEO, ZP, Amaravati has been posted as Collector, Yavatmal.    4.    Shri Avishant Panda, IAS (MH:2017) Assistant Collector and Project Officer, ITDP, Taloda, Nandurbar has been posted as CEO, ZP, Amaravati.    5.    Smt. Vasumana Pant, IAS (MH:2017) Assistant Collector and Project Officer, ITDP, Nandurbar has been posted as CEO, ZP, Washim.",
 "title":"Transfer order 26.03.2021",
"publishdatetime":"26.03.2021"}
,

{"details":"Transfer order dated 28.02.2021    1.    Shri. Manu Kumar Srivastava,  IAS (1986) Additional Chief Secretary (A&S), Home Department, Mantralaya, Mumbai has been posted as Additional Chief Secretary (Home), Home Department, Mantralaya, Mumbai.    2.    Shri. A.M.Limaye, IAS (1989) Additional Chief Secretary (AR&OM), General Administration Department, Mantralaya, Mumbai has been posted as Additional Chief Secretary (A&S), Home Department, Mantralaya, Mumbai.",
 "title":"Transfer order 28.02.2021",
"publishdatetime":"28.02.2021"}
,

{"details":"Transfer order dated 24.02.2021    1.  Shri. G.Sreekanth,  IAS (2009) Managing Director, Maharashtra State Seeds Corporation, Akola has been posted as Joint Commissioner, Sales Tax, Aurangabad.    2.  Shri. L.S.Mali, IAS (2009) Joint Secretary, Rural Development Department has been posted as Director (Disaster Management), Revenue and Forest Department, Mantralaya, Mumbai.    3.  Shri. V.L.Bhimanwar, IAS (2009) has been posted as Deputy Secretary (Information Technology), General Administration Department, Mantralaya, Mumbai.    4.  Shri Rahul Rekhawar, IAS (2011) has been posted as Managing Director, Maharashtra State Seeds Corporation, Akola.    5.  Dr.H.S.Vasekar, IAS (2015) Chief Executive Officer, Zilla Parishad, Sindhudurg has been posted as Chief Executive Officer, National Rural Livelihood Mission, Navi Mumbai.    6.  Shri Prajit Nair, IAS (2017) Assistant Collector and Project Officer, ITDP, Jawhar, Dist. Palghar has been posted as Chief Executive Officer, Zilla Parishad, Sindhudurg.",
 "title":"Transfer order 24.02.2021",
"publishdatetime":"24.02.2021"}
,

{"details":"Transfer order dated 17.02.2021    1.      Shri. A.Limaye, IAS (1989) has been posted as Additional Chief Secretary (AR&OM), General Administration Department, Mantralaya, Mumbai.    2.    Shri. Omprakash Deshmukh, IAS (2004) has been posted as Commissioner for Persons with Disabilities, Pune    3.    Dr.Madhvi Khode-Chawre, IAS (2007) has been posted as Director General, VANAMATI, Nagpur.    4.    Smt.Manisha Khatri, IAS (2014) Director General, VANAMATI, Nagpur has been posted as Additional Commissioner, Tribal Development, Nagpur.    ",
 "title":"Transfer order 17.02.2021",
"publishdatetime":"17.02.2021"}
,

{"details":"  Transfer order dated 12.02.2021    1.   Shri. S.Chokalingam, IAS (1996) Settlement Commissioner and Director, Land Records, Pune has been posted as Director General, YASHADA, Pune.    2.   Shri. N.K.Sudhansu, IAS (2000) has been posted as Settlement Commissioner and Director, Land Records, Pune.    3.   Shri. Shravan Hardikar, IAS (2005) Municipal Commissioner, Pimpri Chinchwad Municipal Corporation, Pimpri, Pune has been posted as Inspector General, Registration and Controller of Stamp, Pune    4.   Shri. Rajesh Patil, IAS (OR:2005) has been posted as Municipal Commissioner, Pimpri-Chinchwad Municipal Corporation, Pimpri, Pune.    5.   Smt.Sheetal Ugale-Teli, IAS (2009) has been posted as Director, Textile, Nagpur.    6.   Smt.Prerna Deshbhratar, IAS (2010) Commissioner for Persons with Disabilities, Pune has been posted as Collector, Wardha.",
 "title":"Transfer order 12.02.2021",
"publishdatetime":"12.02.2021"}
,

{"details":"Transfer order dated 11.02.2021    1.  Shri. S.M.Deshpande, IAS (1991) Principal Secretary (AR&OM), General Administration Department, Mantrlaya, Mumbai has been posted as Principal Secretary and Chief Electoral Officer, Maharashtra Mumbai.",
 "title":"Transfer order 11.02.2021",
"publishdatetime":"11.02.2021"}
,

{"details":"Transfer order dated 04.02.2021    1.    Shri. Baldev Singh, IAS (1989) Principal Secretary and Chief Electoral Officer, Maharashtra Mumbai has been posted as Principal Secretary (Industries), Industry, Energy and Labour Department, Mantralaya, Mumbai.    2.    Shri B.Venugopal Reddy, IAS (1994) Principal Secretary (Industries), Industry, Energy and Labour Department, Mantralaya, Mumbai has been posted as Managing Director, SICOM, Mumbai.    ",
 "title":"Transfer order 04.02.2021",
"publishdatetime":"04.02.2021"}
,

{"details":"Transfer order dated 03.02.2021    1.    Shri. M.M.Suryawanshi, IAS (2010) Joint Secretary, Food, Civil Supplies and Consumer Protection Department, Mantralaya, Mumbai has been posted as Metropolitan Commissioner, NMRDA, Nagpur.    2.    Shri Rahul Rekhawar, IAS (2011) has been posted as Chief Executive Officer, National Rural Livelihood Mission, Navi Mumbai.    3.    Smt.Nima Arora, IAS (2014) Chief Executive Officer, Zilla Parishad, Jalna has been posted as Municipal Commissioner, Akola Municipal Corporation, Akola.",
 "title":"Transfer order 03.02.2021",
"publishdatetime":"03.02.2021"}
,

{"details":"Transfer order dated 29.01.2021    1.   Shri.D.T.Waghmare, IAS (1994) Chairman and Managing Director, M.S. Electric Transmission Co., Mumbai has been posted as Principal Secretary (Energy), Industries, Energy and Labour Department, Mantralaya, Mumbai.    2.   Shri. A.S.K.Gupta, IAS (1994) Principal Secretary (Energy) Industries, Energy and Labour Department, Mantralaya, Mumbai has been posted as Principal Secretary (R&R), Revenue & Forest Department, Mantralaya, Mumbai.    3.   Shri. Vijay Singhal, IAS (1997) has been posted as Chairman and Managing Director, M.S. Electric Distribution Co., Mumbai.    4.   Shri. Kishor Raje Nimbalkar, IAS (2003) Secretary (R&R), Revenue & Forest Department, Mantralaya, Mumbai has been posted as Member Secretary, Maharashtra Jeevan Pradhikaran, Mumbai.",
 "title":"Transfer order 29.01.2021",
"publishdatetime":"29.01.2021"}
,

{"details":"Transfer order dated 19.01.2021    1.  Shri R.S.Jagtap, IAS (2008) Joint Commissioner, Sales Tax, Aurangabad has been posted as Collector, Beed.         Transfer order dated 20.01.2021    1.  Shri A.L.Jarhad, IAS (1997) has been posted as Secretary to Chief Minister, Mantralaya, Mumbai.    2.  Shri Aman Mittal, IAS (2015) Chief Executive Officer, Zilla Parishad, Kolhapur has been posted as Municipal Commissioner, Latur Municipal Corporation, Latur.    3.  Shri S.R.Chavan, IAS (9999) has been posted as Chief Executive Officer, Zilla Parishad, Kolhapur.",
 "title":"Transfer order 19.01.2021 and 20.01.2021",
"publishdatetime":"20.01.2021"}
,

{"details":"Transfer order dated 14.01.2021    1.    Smt.Abha Shukla, IAS (1993), has been posted as Principal Secretary (IT), General Administration Department, Mantralaya, Mumbai.",
 "title":"Transfer order 14.01.2021",
"publishdatetime":"14.01.2021"}
,

{"details":"Transfer order dated 13.01.2021    1.   Shri. Arvind Kumar, IAS (1985), MD, MPCL, Mumbai has been posted as Additional Chief Secretary (Co-Operation), Co-Operation, Marketing and Textile Department, Mantralaya, Mumbai.    2.   Shri. Tukaram Mundhe, IAS (2005), has been posted as Secretary, State Human Rights Commission, Mumbai.    3.   Shri. D.B.Gawade, IAS (2007), has been posted as Joint Secretary, Public Health Department, Mantralaya, Mumbai.    4.   Shri. Uday Jadhav, IAS (9999), Chief Executive Officer, National Rural Livelyhood Mission, Navi Mumbai has been posted as Secretary, Maharashtra State Child Rights Commission, Mumbai.    ",
 "title":"Transfer order 13.01.2021",
"publishdatetime":"14.01.2021"}
,

{"details":"Transfer order dated 07.01.2021    1.   Shri. M.B.Gawade, IAS (2007), has been posted as Joint Secretary, Marathi Bhasha Department, Mumbai.",
 "title":"Transfer order 07.01.2021",
"publishdatetime":"07.01.2021"}
,

{"details":"Transfer order dated 14.12.2020    1.  Shri V.K.Gautam, IAS (1987) Secretary, State Human Rights Commission, Mumbai has been posted as Additional Chief Secretary (Water Resources), Water Resources Department, Mantralaya, Mumbai.",
 "title":"Transfer order 14.12.2020",
"publishdatetime":"14.12.2020"}
,

{"details":"Transfer order dated 09.12.2020    1.      Dr.Ashwini Joshi, IAS (2006) has been posted as Member Secretary, Vidharbha Statutory Development Board, Nagpur.    2.      Shri K.N.Jawale, IAS (9999) Private Secretary, Medical Education and Drugs, Mumbai has been posted as Additional Divisional Commissioner, Konkan Division, Mumbai.    3.      Shri Astha Luthra, IA&AS (2009) MD, SICOM, Mumbai has been posted as MD, MSFC, Mumbai.",
 "title":"Transfer order 09.12.2020",
"publishdatetime":"09.12.2020"}
,

{"details":"Transfer order dated 08.12.2020    1.  Shri G.Sreekanth, IAS (2009) Collector, Latur has been posted as Managing Director, Maharashtra State Seeds Corporation, Akola.    2.     Shri Prithviraj B.P., IAS (2014) Chief Executive Oficer, Zilla Parishad, Parbhani has been posted as Collector, Latur    3.     Shri S.T.Taksale, IAS (9999) Additional Divisional Commissioner, Aurangabad Division, Aurangabad has been posted as Chief Executive Officer, Zilla Parishad, Parbhani",
 "title":"Transfer order 08.12.2020",
"publishdatetime":"08.12.2020"}
,

{"details":"Transfer order dated 03.12.2020    1.  Smt. M.N.Kerketta, IAS (1994) Chief Executive Officer, Maharashtra State Khadi and Village Industries Board, Mumbai has been posted as Principal Secretary (2), Public Health Department, Mumbai.    2.   Dr.Ashwini Joshi, IAS (2006) has been posted as Member Secretary, State Women Commission, Mumbai.",
 "title":"Transfer order 03.12.2020",
"publishdatetime":"03.12.2020"}
,

{"details":"  Transfer order dated 27.11.2020    1.   Shri Vikas Chandra Rastogi, IAS (1995) Principal Secretary (IT), General Administration Department, Mantralaya, Mumbai has been posted as Project Director, Nanaji Deshmukh Krishi Sanjivanee Project, Mumbai.    2.   Dr.H.Modak, IAS (MN:2008) has been posted as Deputy Secretary, Public Health Department, Mumbai.    3.   Dr.Sandeep Rathod, IAS (TR:2009) has been posted as Managing Director, Haffkine Bio-pharma Corporation, Mumbai.    4.   Shri S.L.Ahire, IAS (2009) has been posted as Joint Secretary, Women and Child Welfare Department, Mumbai.    5.   Shri Anil Bhandari, IAS (2010) Managing Director, M.S.Seeds Corporation, Akola has been posted as Joint Commissioner, Sales Tax (Revulation), Mumbai.    6.   Shri Sushil Khodwekar, IAS (2011) Deputy Secretary, School Education and Sports Department, Mantralaya, has been posted as Deputy Secretary, Agriculture and ADF Department, Mantralaya, Mumbai.    7.   Shri B.B.Dangade, IAS (9999) President, District Caste Scrutiny Committee, Raigad has been posted as Chief Executive Officer, Zilla Parishad, Thane.    ",
 "title":"Transfer order 27.11.2020",
"publishdatetime":"27.11.2020"}
,

{"details":"Transfer order 24.11.2020  1. Shri P.B.Yadav, (Appointment by Promotion in IAS) has been posted as Director, Sainik Kalyan, Pune.",
 "title":"Transfer order 24.11.2020.",
"publishdatetime":"24.11.2020"}
,

{"details":"Transfer order dated 18.11.2020    1.      Shri Arvind Kumar, IAS (1985) has been posted as MD, MPCL, Mumbai.    2.      Shri Ashwani Kumar, IAS (1987) MD, MPCL, Mumbai has been posted as Additional Chief Secretary and Officer on Special Duty (Appeals), Revenue & Forest Department, Mantralaya, Mumbai.    3.      Shri O.P.Gupta, IAS (1992) has been posted as Principal Secretary, Higher and Technical Education Department, Mantralaya, Mumbai.    4.      Smt.Seema Vyas, IAS (1992) Secretary, Maharashtra Child Rights Commission, Mumbai has been posted as Principal Secretary and Special Enquiry Officer (1), General Administration Department, Mantralaya, Mumbai.",
 "title":"Transfer order 18.11.2020",
"publishdatetime":"18.11.2020"}
,

{"details":"Transfer order dated 10.11.2020    1.  Smt.Valsa R. Nair Singh, IAS (1991) Principal Secretary and Special Enquiry Officer (1), General Administration Department, Mumbai has been posted as Principal Secretary (Tourism), Tourism and Cultural Affairs Department, Mantralaya, Mumbai.    2.  Shri V.P.Phad (Appointment by Promotion in IAS), Additional Divisional Commissioner (Entertainment) Aurangabad Division, Aurangabad has been posted as Chief Executive Officer, Zilla Parishad, Osmanaba,    3.  Shri K.H.Bagate, (Appointment by Promotion in IAS), Chief Executive Officer, Shri Saibaba Sansthan Trust, Shirdi has been posted as Additional Chief Electoral Officer, Maharashtra, Mumbai.    4.  Shri S.L.Patil, IAS (Appointment by Promotion in IAS)  has been posted as Managing Director, MAHANAND, Mumbai.    5.  Shri D.V.Swami, (Appointment by Promotion in IAS), Deputy Commissioner (Revenue), Nashik Division, Nashik has been posted as Chief Executive Officer, Zilla Parishad, Solapur.    6.  Shri S.R.Chavan, (Appointment by Promotion in IAS) ,Deputy Commissioner (General), Pune Division, Pune has been posted as Project Director, Jalswaraj Project, Navi Mmbai.    7.  Shri K.S.Tawade, (Appointment by Promotion in IAS), Additional Collector (SG), CIDCO, Mumbai has been posted as Managing Director, Shivsahi Punarvasan Project, Mumbai.    8.  Smt. K.V.Dwivedi, (Appointment by Promotion in IAS), Additional Commissioner (SG), PMRDA, Pune has been posted as Additional Metropolitan Commissioner, PMRDA, Pune.    9.  Shri S.B.Telang, (Appointment by Promotion in IAS),  Deputy Commissioner (Revenue) Nagpur Division, Nagpur has been posted as Managing Director, Maharashtra State Co-op Marketing Federation, Mumbai.    10. Shri S.T.Taksale, (Appointment by Promotion in IAS), Additional Divisional Commissioner, Aurangabad Division, Aurangabad has been posted as Additional Commissioner, Tribal Development, Nagpur.    11. Shri P.K.Puri, (Appointment by Promotion in IAS), Deputy Commissioner (Supply) Nashik Division, Nashik has been posted as Joint Secretary, Water Supply and Sanitation Department, Mumbai    12. Shri C.D.Joshi, (Appointment by Promotion in IAS), President, District Caste Scrutiny Committee, Mumbai City has been posted as Commissioner, Maharashtra State Common Entrance Exam Cell, Mumbai ",
 "title":"Transfer order - 10.11.2020",
"publishdatetime":"10.11.2020"}
,

{"details":"Transfer order dated 29.10.2020    1.  Shri Rajesh Kumar, IAS (1988) has been posted as Additional Chief Secretary (RDD and PR), Rural Development Department, Mumbai.    2.  Shri Uday Jadhav, (Appointment by Promotion in IAS) Joint Secretary, Rural Development Department, Mumbai has been posted as Chief Executive Officer, Maharashtra State National Rural Livehood Mission, Navi Mumbai.    ",
 "title":"Transfer order 29.10.2020",
"publishdatetime":"29.10.2020"}
,

{"details":"Transfer order dated 29.10.2020    1.  Shri Rajesh Kumar, IAS (1988) has been posted as Additional Chief Secretary (RDD and PR), Rural Development Department, Mumbai.    2.  Shri Uday Jadhav, (Appointment by Promotion in IAS) Joint Secretary, Rural Development Department, Mumbai has been posted as Chief Executive Officer, Maharashtra State National Rural Livehood Mission, Navi Mumbai.",
 "title":"",
"publishdatetime":"29.10.2020"}
,

{"details":"Transfer order dated 27.10.2020    1.  Shri Rahul Dwivedi, IAS (2010) has been posted as State Project Director, Samgra Siksha Abhiyan, Mumbai.    2.  Shri Shantanu Goel, IAS (2013) Additional Municipal Commissioner, Pune Municipal Corporation, Pune has been posted as Commissioner, Mahtma Gandhi National Rural Employment Gurantee Scheme, Maharashtra, Nagpur.    3.  Shri Ajit Patil, IAS (KL:2007) has been posted as Joint Secretary, General Administration Department, Mantralaya, Mumbai.    4.  Shri M.V.Mohite, (Appointment by Promotion in IAS) Additional Divisional Commissioner, Amaravati Division, Amaravati has been posted as Chief Executive Officer, Zilla Parishad, Washim.",
 "title":"Transfer order 27.10.2020.",
"publishdatetime":"27.10.2020"}
,

{"details":"  Transfer order dated 23.10.2020    1. Shri Ashwani Kumar, IAS (1987) has been posted as Managing Director, Maharashtra State Financial Corporation, Mumbai.    2. Shri N.Nawin Sona, IAS (2000) Managing Director, Maharashtra State Cotton Growers Marketing Federation, Mumbai has been posted as Member Secretary, Rest of Maharashtra Statutory Board, Mumbai.    3. Shri A.B.Unhale, IAS (2004) has been posted as Managing Director, Maharashtra State Cotton Growers Marketing Federation, Mumbai.    4. Shri A.S.Ranga Naik, IAS (2009) Commissioner, MGNREGS, Nagpur has been posted as Joint Chief Executive Officer, Maharashtra Industrial Development Corporation, Mumbai..    5. Shri M.B.Warbhuwan, IAS (2010) has been posted as Joint Secretary, General Administration Department, Mantralaya, Mumbai (by partial modification in the order dated 19.10.2020)    6. Shri D.B.Halde, IAS (2010) Managing Director, Maharashtra State Co-operative Marketing Federation has been posted as Director Other Backward Bahujan Welfare , Pune.    7. Shri Shanmugrajan S., IAS (2013) Chief Executive Officer, Zilla Parishad, Buldhana has been posted as Collector, Washim.    8. Smt.Manisha Khatri, IAS (2014) Member Secretary, Vidharbha Statutory Development Board, Nagpur has been posted as Director General, VANAMATI, Nagpur.    9. Smt.Buvneswari S., IAS (2015) Chief Executive Officer, Zilla Parishad, Bhandara has been posted as Chief Executive Officer, Smart City, Nagpur.    10.  Smt.Bhagyashree Vispute, IAS (2017), Assistant Collector and Project Officer, ITDP, Pandharkawada, Dist. Yavatmal has been posted as  Chief Executive Officer, Zilla Parishad, Buldhana.    11.  Shri Vivek Johnson, IAS (2018), Assistant Collector and Project Officer, ITDP, Bhandara, Dist. Bhandata has been posted as Assistant Collector and Project Officer, ITDP, Pandharkawada, Dist. Yavatmal.    12.  Shri A.G.Ramod, (Appointment by Promotion in IAS) President, District Caste Certificate Scrutiny Committee, Osmanabad has been posted as Additional Divisional Commissioner, Pune Division, Pune.    13.  Shri V.S.Moon (Appointment by Promotion in IAS) President, District Caste Certificate Scrutiny Committee, Chandrapur has been posted as Chief Executive Officer, Zila Parishad, Bhandara.",
 "title":"Transfer order 23.10.2020",
"publishdatetime":"23.10.2020"}
,

{"details":"Subject :      Seeking officer on deputation to the post Executive Director -IPDS- in Power Finance Corporation Ltd.       Power Finance Corporation Ltd., New Delhi has invited the Nominations for the filling up the post of Executive Director (IPDS) in Power Finance Corporation Ltd..      Interested officers are requested to contact Under Secretary, General Administration Department, Mantralaya, Mumbai immediately before 16.01.2018 positively. (Tel.No.022-22874955 or 22793205) for further details.    Sd/-  Under Secretary to the  Government of Maharashtra",
 "title":"Seeking officer on deputation to the post Executive Director -IPDS- in Power Finance Corporation Ltd.",
"publishdatetime":"20.10.2020"}
,

{"details":"Transfer order dated 19.10.2020    1.  Shri Pravin Darade, IAS (1998), has been posted as Managing Director, Maharashtra Small Scale Industries Development Corporation, Mumbai.    2.  Smt.Jayshree Bhoj, IAS (2003), Managing Director, Maharashtra Small Scale Industries Development Corporation, Mumbai has been posted as Managing Director, Maharashtra Information Technology Corporation, Mumbai.    3.  Shri A.R.Kale, IAS (2005) has been posted as Commissioner, Food and Drugs Administration, Mumbai.    4.  Dr.Ashwini Joshi, IAS (2006) has been posted as Managing Director, MPCL, Mumbai.    5.  Dr.M.S.Kalshetti, IAS (2007), has been posted as Director, Groundwater Survey Development Agency, Pune.    6.  Shri R.B.Bhosale, IAS (2008), Additional Divisional Commissioner, Pune Division has been posted as Collector, Ahmednagar.    7.  Shri H.P.Tummod, IAS (2008), has been posted as Commissioner, Dairy Development, Mumbai.    8.  Dr. K.H.Kulkarni, IAS (2009) has been posted as Director, Municipal Administration, Mumbai.    9.  Shri C.K.Dange, IAS (2010) has been posted as Project Director, M.S.AIDS Control Society, Mumbai.    10. Shri M.B.Warbhuwan, IAS (2010) has been posted as Chief Executive Officer, Mahtma Jyotiba Phule Jan Arogya Yojna Society, Mumbai.    11. Shri R.S.Kshirsagar, (Appointment by Promotion in IAS) Additional Divisional Commissioner, Konkan Division, has been posted as Chief Executive Officer, Zila Parishad, Ahmednagar.    12. Shri B.B.Dangade, (Appointment by Promotion in IAS) President, District Caste Certificate Scrutiny Committee, Raigad has been posted as Secretary, Fee Regularity Authority, Mumbai.    13. Shri R.K.Gawade, (Appointment by Promotion in IAS) Deputy Commissioner (General), Nashik Division has been posted as Chief Executive Officer, Zila Parishad, Nandurbar.    14. Smt.Pallavi Darade, IRS (1997) has been posted as Joint Secretary, Home Department, Mantralaya, Mumbai (Appeal & Security).    15. Dr. Sudhakar Shinde, IRS (2007) Chief Executive Officer, Mahtma Jyotiba Phule Jan Arogya Yojna Society, Mumbai has been posted as Deputy Secretary, General Administration Department, Mantralaya, Mumbai.",
 "title":"Transfer order 19.10.2020.",
"publishdatetime":"19.10.2020"}
,

{"details":"Transfer order dated 08.10.2020    1.      Smt.Kadambari Balkawade, IAS (2010), has been posted as Municipal Commissioner, Kolhapur Municipal Corporation, Kolhapur.  ",
 "title":"Transfer order 08.10.2020.",
"publishdatetime":"08.10.2020"}
,

{"details":"Transfer order dated 24.09.2020    1.   Shri Vinay Gawda G.C., IAS (2015), Chief Executive Officer, Zilla Parishad, Nandurbar has been posted as Chief Executive Officer, Zila Parishad, Satara.    2.   Smt. Varsha D. Thakur, (Appointment by Promotion in IAS) Deputy Commissioner (General Administration), Aurangabad Division has been posted as Chief Executive Officer, Zila Parishad, Nanded.",
 "title":"Transfer order 24.09.2020",
"publishdatetime":"24.09.2020"}
,

{"details":"Transfer order dated 18.09.2020    1.      Shri R.V.Nimbalkar, IAS (2007), has been posted as Chief Executive Officer, Slum Rehabiliation Authority, Pune.    2.      Dr S.G.Kolte, IAS (2010), Chief Executive Officer, Slum Rehabilitation Authority, Pune has been posted as Chief Executive Officer, Pune Smart City, Pune.    3.      Shri H.S.Sonawane, IAS (2010), Chief Executive Officer, Zilla Parishad, Thane has been posted as Commissioner, Tribal Development, Nashik.    4.     Shri S.K.Salimath, (Appointment by Promotion in IAS) Deputy Commissioner (Revenue), Konkan Division has been posted as Chief Executive Officer, Zila Parishad, Palghar.    5.    Shri P.K.Dange, (Appointment by Promotion in IAS) Managing Director, Mahtma Jyotiba Phule Research and Training Institute, Nagpur has been posted as Chief Executive Officer, Zila Parishad, Gondia.",
 "title":"Transfer order 18.09.2020",
"publishdatetime":"21.09.2020"}
,

{"details":"Transfer order dated 10.09.2020    1.      Shri Manu Kumar Srivastava, IAS (1986), has been posted as Additional Chief Secretary (A&S), Home Department, Mantralaya, Mumbai.    2.      Shri E.Ravendiran, IAS (2008), has been posted as Joint Commissioner, Sales Tax, Mumbai.    3.      Shri M.J.Pradip Chandren, IAS (2012), has been posted as Managing Director, Maharashtra State Minining Corporation, Nagpur.  4.     Shri Kailash Shinde, IAS (2013), has been posted as Joint Managing Director, CIDCO, Navi Mumbai.  ",
 "title":"Transfer order 10.09.2020.",
"publishdatetime":"10.09.2020"}
,

{"details":"Transfer order dated 09.09.2020    1.      Shri Anil Diggikar, IAS (1990), has been posted as Vice President and Chief Executive Officer, MHADA, Mumbai    2.      Shri Amit Saini, IAS (2007) Joint Commissioner, Sales Tax, Mumbai has been posted Chief Executive Officer, Maharashtra Maritime Board, Mumbai.    3.      Shri Prashant Narnaware, IAS (2009) has been posted as Commissioner, Social Welfare, Pune.    4.      Shri S.Ramamoorthy, IAS (2013) Managing Director, Maharashtra State Mining Corporation, Nagpur has been posted as Collector, Buldhana.    5.      Shri Deepak Kumar Meena, IAS (2013) Chief Executive Officer, Zilla Parishad, Washim has been posted Collector, Gondia.    6.      Shri Vivek Johnson, IAS (2018) Super Numerary Assistant Collector,Osmanabad has been posted as Project Officer, Integrated Tribal Development Project, Bhandara Dist. Bhandara and Assistant Collector, Bhandara Sub Division, Dist.Bhandara",
 "title":"Transfer order 09.09.2020",
"publishdatetime":"09.09.2020"}
,

{"details":"  Transfer order dated 08.09.2020    1.      Shri A.A.Shingare, IAS (2009), Jt.Managing Director, CIDCO, Navi Mumbai has been posted as Member Secretary, Maharashtra Pollution Control Board, Mumbai    2.      Shri S.G.Kolte, IAS (2010), Chief Executive Officer, Zilla Parishad, Osmanabad has been posted as Chief Executive Officer, Slum Rehabilitation Authority, Pune.    3.      Smt.Deepa Mudhol-Munde, IAS (2011) has been posted as Chief Administrator (New Town), CIDCO, Aurangabad. ",
 "title":"Transfer order 08.09.2020",
"publishdatetime":"08.09.2020"}
,

{"details":"Transfer order dated 03.09.2020    1.    Shri Vikas Chandra Rastogi, IAS (1995) Project Director, Nanaji Deshmukh Krishi Sanjevanee Project, Mumbai has been posted as Principal Secretary (IT), General Administration Department, Mantralaya, Mumbai. ",
 "title":"Transfer order 03.09.2020",
"publishdatetime":"03.09.2020"}
,

{"details":"Transfer order dated 02.09.2020    1.    Shri M.G.Gursal, IAS (2009) Secretary, Fee Regulatory Authority, Mumbai has been posted as Collector, Palghar. ",
 "title":"Transfer order 02.09.2020",
"publishdatetime":"02.09.2020"}
,

{"details":"Transfer order 31.08.2020  1. Shri R.V.Game, IAS (2005), has been posted as Divisional Commissioner, Nashik Division, Nashik.",
 "title":"Transfer order 31.08.2020",
"publishdatetime":"31.08.2020"}
,

{"details":"Transfer order dated 26.08.2020    1. Shri S.J.Kunte, IAS (1985) Additional Chief Secretary (P), General Administrative Department, Mantralaya, Mumbai has been posted as Additional Chief Secretary (Home), Home Department, Mantralaya, Mumbai.  2. Smt.Sujata Saunik, IAS (1987) Additional Chief Secretary, Skill Development and Entrepreneurship Department, Mantralaya, Mumbai has been posted as Additional Chief Secretary (P), General Administration Department, Mantralaya, Mumbai..  ",
 "title":"Transfer order 26.08.2020",
"publishdatetime":"26.08.2020"}

]